def fidel_value_pair():
    fidel_value_pair = {('ሀ', 'ሁ', 'ሂ', 'ሃ', 'ሄ', 'ህ', 'ሆ', 'ሇ'): 1,
                        ('ለ', 'ሉ', 'ሊ', 'ላ', 'ሌ', 'ል', 'ሎ', 'ሏ', 'ከ', 'ኩ', 'ኪ', 'ካ', 'ኬ', 'ክ', 'ኮ', 'ኳ', 'ኰ', 'ኲ'): 2,
                        ('ሐ', 'ሑ', 'ሒ', 'ሓ', 'ሔ', 'ሕ', 'ሖ', 'ሗ'): 3,
                        ('መ', 'ሙ', 'ሚ', 'ማ', 'ሜ', 'ም', 'ሞ', 'ሟ', 'አ', 'ኡ', 'ኢ', 'ኣ', 'ኤ', 'እ', 'ኦ', 'ኧ', 'ደ', 'ዱ', 'ዲ',
                         'ዳ', 'ዴ', 'ድ', 'ዶ', 'ዷ', 'ጀ', 'ጁ', 'ጂ', 'ጃ', 'ጄ', 'ጅ', 'ጆ', 'ጇ', 'ጰ', 'ጱ', 'ጲ', 'ጳ', 'ጴ', 'ጵ',
                         'ጶ', 'ጷ', 'ፈ', 'ፉ', 'ፊ', 'ፋ', 'ፌ', 'ፍ', 'ፎ', 'ፏ'): 4,
                        ('ሠ', 'ሡ', 'ሢ', 'ሣ', 'ሤ', 'ሥ', 'ሦ', 'ሧ'): 5,
                        ('ረ', 'ሩ', 'ሪ', 'ራ', 'ሬ', 'ር', 'ሮ', 'ሯ', 'ኘ', 'ኙ', 'ኚ', 'ኛ', 'ኜ', 'ኝ', 'ኞ', 'ኟ', 'ነ', 'ኑ', 'ኒ',
                         'ና', 'ኔ', 'ን', 'ኖ', 'ኗ', 'የ', 'ዩ', 'ዪ', 'ያ', 'ዬ', 'ይ', 'ዮ', 'ዯ'): 6,
                        ('ሰ', 'ሱ', 'ሲ', 'ሳ', 'ሴ', 'ስ', 'ሶ', 'ሷ', 'ሿ', 'ሸ', 'ሹ', 'ሺ', 'ሻ', 'ሼ', 'ሽ', 'ሾ'): 7,
                        ('ቀ', 'ቁ', 'ቂ', 'ቃ', 'ቄ', 'ቅ', 'ቆ', 'ቋ', 'ቈ', 'ቊ', 'ኅ', 'ኁ', 'ኂ', 'ኃ', 'ኄ', 'ኅ', 'ኆ', 'ኋ', 'ኈ',
                         'ኊ', 'ዘ', 'ዙ', 'ዚ', 'ዛ', 'ዜ', 'ዝ', 'ዞ', 'ዟ', 'ዠ', 'ዡ', 'ዢ', 'ዣ', 'ዤ', 'ዥ', 'ዦ', 'ዧ', 'ገ', 'ጉ',
                         'ጊ', 'ጋ', 'ጌ', 'ግ', 'ጎ', 'ጓ', 'ጐ', 'ጒ', 'ጸ', 'ጹ', 'ጺ', 'ጻ', 'ጼ', 'ጽ', 'ጾ', 'ጿ', 'ፐ', 'ፑ', 'ፒ',
                         'ፓ', 'ፔ', 'ፕ', 'ፖ', 'ፗ'): 8,
                        ('በ', 'ቡ', 'ቢ', 'ባ', 'ቤ', 'ብ', 'ቦ', 'ቧ'): 9,
                        ('ተ', 'ቱ', 'ቲ', 'ታ', 'ቴ', 'ት', 'ቶ', 'ቷ', 'ቸ', 'ቹ', 'ቺ', 'ቻ', 'ቼ', 'ች', 'ቾ', 'ቿ', 'ዐ', 'ዑ', 'ዒ',
                         'ዓ', 'ዔ', 'ዕ', 'ዖ'): 10,
                        ('ወ', 'ዉ', 'ዊ', 'ዋ', 'ዌ', 'ው', 'ዎ', 'ዏ', 'ጠ', 'ጡ', 'ጢ', 'ጣ', 'ጤ', 'ጥ', 'ጦ', 'ጧ', 'ጨ', 'ጩ', 'ጪ',
                         'ጫ', 'ጬ', 'ጭ', 'ጮ', 'ጯ', 'ፀ', 'ፁ', 'ፂ', 'ፃ', 'ፄ', 'ፅ', 'ፆ', 'ፇ'): 0, }
    return fidel_value_pair
def kokeb_disc_pair():
    kokeb_name_discription_pair = {
        'ሐመል-እሳት/Aries': '\tሐመል እሳት የእሳት ነበልባል ማለት ነው ከመጋቢት 14  ቀን ጀምሮ ማታ ማታ ይወጣል ይህ ኮከብ ያለው ሰው እንደ ኮከቡ ብርሀን አእምሮው ብሩህ ነው እጅግ ሀይለኛና ደፋር ነው የአንደበት ስጦታ አለው ደግነት አያጣም ከፍ ያለ ሐሳብ አለው ከሽምግልና ጊዜው አስቀድሞ በአለው ዘመኑ መርሳትና መዘንጋት የለውም አደርገዋለው ይሆንልኛል ብሎ የወጠነው ስራና ነገር ሁሉ ይከናወንለታል ወደ አሰበው ለመድረስ ብዙ መሰናከል ያገኘዋል ነገር ግን በሀሳቡ ቆራጥነት ሁሉንም በመጨረሻ ያሸንፉል። እሳትነቱን የሞያጠፋው ኮከብ የለውም አድመኛ ነው ግን ተንኮለኛ አይደለም ሴትን ይፈራል እጅግ ለጋስ ነው ተበድሮም ቢሆን ይሰጣል ወዳጅና ጠላቱን መምረጥ አያውቅም ለባለንጀርነት ዝቅተኞችን ይመርጣል ሳያጣና ሳያገኝ ይኖራል ገንዘቡ ይመጣና ይሄዳል እጁ አመድ አፋሽ ነው ሰጥቶ አይመሰገንም ቅንዝረኛ ነው ከ30 አመት በሁዋላ ባለፀጋ ይሆናል ሰፊ ዝና አለው ከብዙ ሰው ጋር ይተዋወቃል። የወለደው አይባረክለትም እስከ መግደል ድረስ ይሻዋል የሽምግልና ጊዜውን በትካዜ ይገፋዋል ምናልባትም የረጅም ጊዜ እስራት ያገኛዋል በእልህ ምክንያት እድሉን ያበላሸዋል ቂመኛና ተበቃይ አይደለም በዳኝነትና ፅህፈት እውቀቱ ከፍ ያለ ነው ነገር መተቸትና ማስተካከል ያውቃል ህልሙ የታመነ ነው ንጉስና መኳንንት ያፈቅሩታል አፈ ከባድ ሀብታም ነው በአራቱ ማእዘን ሰው ሁሉ ይሰግድለታል። በዘመነ ማቴዎስ ሞት ያስፈራዋል በጥቅምት ወር ሆዱን ራሱን ግራ እግሩን ያመዋል ስራይ ይስፈራዋል በ15 እና 22 አመቱ ክፉኛ ይታመማል በ50 አመቱ ክፉ ነገር ያገኘዋል በዘመነ ሉቃስ ምርጫ መስከረም ህዳር በሚያዚያና ሀምሌ ውጋትና ሳል ያመዋል በታመመ ጊዜ የዝግባ ቅጠል ዘፍዝፎ ይታጠብ ሙጫውንም ይቆርጥም። ጋኔና አንበሳ አጥፊው ነው ሲታመም ፅጌሬዳና ሰሊጥ የእርግብ ስጋ ይብላ መረቋንም ይጠጣ ክንፋንም ይታጠን። ሰናይ እለቱ ሰኞ ማክሰኞ ቅዳሜ ነው እኩይ እለቱ ሮብ አርብ እና እሁድ ነው ሙድሃኒቱ በአዳል በግ ወይም በነጭ ፍየል ብራና መፍትሔ ስራይ ለአይነ ጥላ መርበብተ ሰለሞንን ለማእሰረ አጋንንት አብድም ሰይፈ መለኮትን አፅፎ ይያዝ ቀይና ነጭ በግ ይረድ ቀይ ዝርዝር ዶሮ ይረድ አምበላይ አፈሾሌ ፈረስ ይጫን ቤተመንግስት ንግድ እርሻ ክፍሉ ነው ኑዊሕ ገፁ ፍሡሕ ነው ዓይኑ እንደኮከብ ብሩህ ነው 4 ሴት ያገባል ሶl3 ልጆች ይወልዳል አባት እናቱን አይቀብርም ነጫጭ መገርና ከብቶች ይሆንለታል ምቀኛ እንደጦር ይነሳበታል ለጊዜው ልቡ ይፈራል ያመነታል የኋላ ኃላ ግን በድፍረት ተነስቶ ጠላቶቹን ሁሉ ድል ያደርጋቸዋል። ለጊዜው ቁጡ ነው ኋላ ግን ፈጥኖ ይመለሳል ሩህሩህ ነው ጥቂት ዘመን ዘማዊነት አለበት የሴቶች በሽታ ያስፈራዋል በፊት ሀብት ያገኛል በመካከል ይደኸያል እስከ 30 አመት መቅሰፍት ያስፈራዋል ከ30 አመት በሁዋላ ግን ሀብትና እድሜ በብዛት ያገኛል ቀይ ነገር ሁሉ ክፍሉ ነው በቀይ መሬት ይኑር ። የሴት መድሀኒት ያስፈራዋል ጠላቱ እጅግ ብዙ ነው ወደ እግዚያብሄር ፀሎት ያዘውትር ምፅዋቱና ፀሎቱ ይሰምርለታል ደዌ ያስፈራዋል ሴሰኛ ነው ሲታመም መድሃኒቱ ቀይና ነጭ የጥቁር ቡሃ በግ እርዶ ሐሞቱን ይጠጣ እሳትና ውሀሙላት አጥፊው ነውና ይጠንቀቅ።እኩይ ወሩ ጥቅምት ነው በዘመነ ማቴዎስ ሮብ ወይም አርብ ቀን በጀምበር ግባት በ82 አመቱ ይሞታል። \n\tሐመል ኮከብ ያላት ሴት የሆነች  እንደሆነ :- እግረ ወልሻሻ አይነ መልካም ናት በጥርሷ ምልክት አለባት ወደ ምስራቅ ትሄዳለች ፀጉረ መልካም ደረቅ፣ ተቀያሚ በልቧ ቂም ቋጣሪ ናት አፋ ጥርሷ ፀጉሯ ያምራል ወንዶች በፍቅር መኝታ ይወዷታል ልጆች ትወልዳለች በሁዋል ግን ማህፀንዋን ሾተላይ ይመታታል በስራዋ ተመካሂ ራሱዋን አኩሪ ናት ቅናትና እብለት ወረትም አለባት ሆዷን ያማታል ከ30 አመቷ በሁዋላ ሰውነቷ ይበርዳል ተራክቦን ተትዋለች ወደ ምስራቅ አገር ብትቀመጥ ይሻላታል እድሜዋ 70 ዓመት ነው።',
        'ሰውር-መሬት/Taurus': '\tይህ ኮከብ በ ሚያዝያ 16 በአዜብ በኩል የሚወጣ ነው ይህ ኮከብ ያለው ሰው እጅግ ገራም ነው ምስጢራዊ ባህሪ አለው የአደረገው ነገር ሁሉ አይታወቅበትም ምክንያቱም ኮከቡ ድብቅ ወይም ስውር ስለሆነ ነው ። እጅግ ጌጥ ይወዳል አይገባውም እንጂ ገንዘብ ማውጣት ጭንቁ ንፉግ ነው ሃብቱ ስውር የኃላ ኋላ ነው በሰውነቱ ተመካሒ አፈፃድቅ ነው ቅናትና ምቀኝነት አለበት ሲያውቅ አለአዋቂ ይመስላል አንደበቱ ዝግተኛና ልዝብ ነው ቀልድ ና ጨዋታ እድሉ ነው እርሻ ንግድ ቤተመንግስት ይሆንለታል ሰላማዊ ነው ኩሩ መስሎ ይታያል ከሰው ጋር በቶሎ አይላመድም በቤተ ሰዎቹ ላይ ሀይለኛ ገዥ ነው ከበታች ያሉትን ያጠቃል ፍርሀት አያውቅም ልበ ሙሉ ወረተኛና ውለታ ቆጣሪ ብልህ ነው ነገር ግን ሰው አያምነውም እርሱም ሰውን አይምንም ለሁሉ ጠርጣሪ ነው። ከአሰበው አይመለስም የሰው ምክር አይቀበልም ራሱን ከፍ አድርጎ ገማችና እኔ እበልጥ ባይ ነው በተግባሩ ሁሉ አምላክን ይለምናልና ይረዳዋል ጠላቶችን ሁሉ በፀሎቱ ድል ያደርጋቸዋል በኋላ ዘመን ገንዘብ ያልቅበታል በጥቂት መጠጥ ይሰክራል ሆዳም ነው በመብልና መጠጥ ስራይ ያስፈራዋል የሚያደርጉበትም ዘመዶቹ ናቸው ወደ ዘመነ እርጅናው የአይን ህመም ያስፈራዋል በጋብቻው የታመነ ነው የተባረኩ ልጆች ይወልዳል እድሉ በአንድ ድንገተኛ ነገር ነው 4 ልጆች ይወልዳል መሐላ አይሆነውምና በእውነትም ቢሆን አይማል። ክፍሉ ነጭና ቀይ መሬት ነው መሸጥ መግዛት መለወጥ ሹመት ክፍሉ ነው ማስተዳደርና ስርአት ያውቃል ቆላ አገር አይሆነውም ደጋ ይስማማዋል በዘመነ ማርቆስ ጥቅምትና ግንቦት ሩቅ አገር አይሒድ ቅሥፈት ያገኘዋል ከሚወልዳቸው ልጆች አንዱ ህመምተኛ ይሆናል ሰው ሲሞት ሬሳ አይገንዝ፣ ታስሮ ይፈታል በዘመነ ማርቆስ በመጋቢት ወር ሹመት ያገኛል  በዘመነ ማርቆስ ሩቅ ሀገር አይሂድ ጥቅምትና ግንቦት ቤት አይለውጥ ቅስፈት ያስፈራዋል ሰውነቱ ሃያልና ደፋር ነው እንደ አይነት እያደረገ ያመዋል ሆዱ እንደ ስራይ ይገለባበጣል  ጥሬ እርጥብ ስጋ አይወድለትም ጠብሶና ቀቅሎ ይብላ ቅናትና ምቀኝነት አሉበት ተመካሒ ሕልሙ እሙን ነው። ጋብቻው አሰድ አቅራብ ህብሩ ሚዛን ቀውስ ሐመል ነው እኩይ እለቱ ረቡ አርብ እሑድ ነው የአርብ ቀን ያስፈራዋል  ነጭና ቀይ በግ አርዶ በደሙና በፈርሱ ይታጠብ በ9 አመቱ ያመዋል በሰላሳ አመቱ ግን ሞት ያስፈራዋል ከወንጌለ ዮሐንስ ወሀሉ አንድ ብእሲ የሚለውን አፅፎ ይያዝ ከበሽታ ሁሉ ለጥፋት የሚያደርሰው ዋና ፀሩ ተስቦ ነው ለዚህ መጠበቂያው ቢሆን በሚዳቆ ቢታጣ ግን በነጭና ቀይ የፍየል ብራና አቅዳፌር አፅፎ መያዝ ነው። የሚመለከቱት ዛሮች ጢሞቴዎስና ብር እለንጋ ከውላጅም ደም ቀለቡና ዋስ አጋች ናቸው ራሱንና ዓይኑን ልቡን እየከፈለ ያመዋል በግራ አይኑና በግራ እግሩ ምልክት አለበት ሴት ጋኔን አለችበት ሌሊት በህልሙ ታስደነግጠዋለች ሌሊት ልብሱን ታስጥለዋለች ምቀኛ ሆና ሃብቱን ትዘጋበታለች እርሷን ለማስለቀቅ የሚበጀው ጊዜዋ ጉመሮ እጣን የጅብ አር ዋግራ ድብርቅ አልቲት የዶሮ ላባ እነዚህን በአንድነት ይታጠን ስመ አምላክና ወንጌ ማርቆስ ድርሳነ ሚካኤልን በሌሊት ውሀ እያስደገመ ከእነዚያ መድሀኒቶችም በውሀው ጨምሮ ይታጠብ ። ሰናይ ወሩ ታህሳስ እኩይ ወሩ ጥቅምት ጥር ግንቦት ነውና ይጠንቀቅ ቁርጥማት ወይም ቂጥኝ  ከጥቁር ሴት ያስፈራዋል መድሃኒቱ ጣዝማ ሰሊጥ ጊዛዋ በማር ይዋጥ ከልከሎሳ የሚባል ጋኔን በተወለድ እለት አይቶታልና በታመመ ጊዜ ያብዳል መድሃኒቱ ነጭ በግ ቀይ ዶሮ የበሬ ቁንድ 40 ቀን ያልሞላው የመቃብር አፈር በአንድነት አሳርሮ ውሀ ባልነካው ቅቤ አድርጎ በአራት ማእዘን መንገድ ላይ ቁሞ ይቀባ ከእራሪውም በጠጅ አንፍሮ ሶስት ቀን ይጠጣና ይለቀዋል። በእግሩ  ቁርጥማት ይሰማዋል በራሱ በልቡ በሆዱ በሽታ ይገባበታል ለዚህ ህመም መድሃኒቱ ዋግራ ድብርቅ አልቲት ሮብ ቀን ሰብስቦ ከጥቁር ስንዴ ጋር በጨው አንፍሮ ለቀይ በግ ሰባት ቀን ማብላት ነው በሁዋላ በጉን አርዶ በደሙ ታጥቦ ስጋውን ቀቅሎ መረቁን በስንዴ እንጀራ እየፈተፈተ ይብላ ከእህልም ስንዴ ግጥሙ ነው ከመረቁ ይጠጣ ቀይ ዶሮ ወሰራ ጭዳ ይበል ሞቱ በዘመነ ማርቆስ በሰባኛ አመቱ በወርሀ ጥቅምት ሮብ ቀን ነው።\n\tሰውር መሬት ኮከብ ያላት ሴት የሆነች እንደሆነ :- እውር ደም ይመታታል አይኗ ቀላ ያለ ጥሩ ነው ቀናተኛ ናት አመንዝራነት አለባት ባሏን በእጁ ነፍስ እስኪያሳልፍ ድረስ ታስቀናዋለች ቅዳሜ ቀን አይሆናትም ደም ከፈሰሰበት ሥፍራ አትድረስ በመቃብር የሚኖር ከልከሎሳ የእሚባል ጋኔን ይፃረራታል ግራ አይኗን ያማታል ሆዷን እያላመጠ ደም እንደ ውሀ ይፈሳታል እግሯን ይቆረጥማታል ሰኔና ጥቅምት አይሆናትም አቅዳፌር በእንስት ሚዳቋ ብራና አፅፋ ትያዝ የጥቁር ገብስማ  ዶሮ ጭዳ ብላ ስጋውን ሠርታ ኮረሪማ ሰልቃ በበላዩ ነስንሳ ስጋውን ትብላ መረቁንም ትጠጣ ከዚህ በሁዋላ የደም ፅሁፍና አቅዳፌር ጨምራ ትያዝ ሰውነቷ በፊቷ ደንዳና ነው ፀጉሯ ልስልስ ነው ስስት አለባት ቁም ነገርና ሃይማኖትም ይገኝባታል።',
        'ገውዝ-ነፋስ/Gemini': '\tበግንቦት 14 ቀን የሚወጣ ኮከብ ነው ነገሩ ዶርዝ ጥንድ ነፋስ ማለት ነው በቀበሮና ዋልያ ይመሰላል ይህ ኮከብ ያለው ሰው ፀጥታ የለውም ብልህ መሠሪ ጥዑመ ልሳን ራሱን ጠባቂ ርጉዕ ድምፁ ከበድ ያለ ቀልድና ዋዛ አዋቂ ነው ነገር ሁሉ በቶሎ ይፈፀምለታል በልቡ ፍርሀት የለውም በሰው ነገር ዘሎ መግባት አይወድም ባለንጀራውን አያምንም በትንሽ ነገር አዝኖ በትንሽ ነገር ይደሰታል ምህረት የሌለው ቂመኛ ነው መሐላ ይደፍራል አክብሩኝና አወድሱኝ ባይ ነው መኳንንትና ጌታ ይወዱታል ጥቂት እርግማን አለው። እኩያው ካልሆኑት ከበላዮቹ  ጋር ባልነጀርነት ይገጥማል ግን አይጠቅሙትም ብዙ ሰምቶ ጥቂት ይናገራል ደስታውንና ኃዘኑን ለሰው አያካፍልም ከአንገት በላይ ይናገራል ለሰው መሸንገልና ማታለል እድሉ ነው። ሳይታወቀው ይሰጥና እንደገና ይጠጣታል ሁሌ ሰው ይጠረጥራል አሽከሮቹና ዘመዶቹ ጠላቶቹ ይሆናሉ።ስሙ በክፉ ይጠራል ከሚስቱ ብቻ ይወልዳል ከሌላ ቢወልድ አይባረክለትም መስጠት እንጂ መቀበልን አይወድም ዕቡይ ምቀኛውም ብዙ ነው እርሱም ለሰው ምቀኛ ነው  ቢታመም ፈጥኖ ይድናል ዓይነ ደረቅና ደፋር ነው። በባዕድ ሀገር በዘመነ ማርቆስ ሹመት ያገኛል ዕድሉ ባልተወለደበት ሀገር ነው ወደ ምስራቅ ሄዶ መኖር ይሆነዋል ንግድ ክፍሉ ነው። ከሃምሳ አመት በኋላ ባለፀጋ ይሆናል። ጾምና ጸሎቱ ይሠምርለታል በዘመነ ማቴዎስ ታሥሮ ይፈታል ነጭ ነገር ክፍሉ ነው ዋገምት ይታገም ጤና ያገኛል በ7 አመቱ መቅሰፍት ያስፈራዋል ሠናይ ወሩ ታህሳሳ መጋቢት ሚያዝያ እኩይ ወሩ ሰኔ ነሃሴ ጥቅምት ነው። በ20 እና በ 45 አመቱ ደዌ ያስፈራዋል ቀይና ነጭ በግ ይረድ የፋኑኤልን ሰላምታ አፅፎ ይያዝ የሉቃስና ዮሐንስ ወንጌልን አስነብቦ 7ቀን ይጠመቅ። አይኑንና ልቡን ያመዋል ፈጣን እንዲሆን የአህያ ሰኮና በግራ ክንዱ ይያዝ ዘማዊነት አለው ግራ እግሩን ብረት ይወጋዋል ፌራና ንዳድ ያስፈራዋል እርሻም ይሆንለታል ቁመቱ ድልድል መንጋጋው ትልልቅ ነው በሴት ምክንያት ትዳሩ ይሰናከልና እንደገና ይታረቃል። ዓይነ ደረቅ ሃይለኛ ጋኔን ክንዱን ትከሻውን ያመዋል ዋስ አጋች የሚባል ዘር በሕልሙ እየተመላለሰ ይጠናወተዋል መድሃኒቱ እንኮይና ቅቤ በወይን ቅጠል አቡክቶ ይጠጣ ቁርጥማት ያመዋል ጉመሮ ጅብራ  አውጥ በአዲስ ዋንጫ ዘፍዝፎ ይታጠብ ራሱን ሆዱን ጉረሮውን ያመዋል ከዛር የተወለደ ጋኔን ስሙ ረዋዲና ጉዳሌ የሚባል ይመለከተዋል ለቁራኛው አይነት ይዋጣለታል ጭማውንና ጉልበቱን ይቆረጥመዋል ወሰን ገፊ የሚባል ዛር ሳይታወቅ ተደርቦ ይፃረረዋል በሽታው የሚብሰው በሰኔ ነው ለዚህ መድሃኒቱ የዝግባ ሙጫና የመስክ አበባ መታጠን ነው ይህ ኮከብ ያለው ሰው ጭዳው በጥቅምት ወር ነጭ ፍየልና ነጭ ዶሮ ነው በነጭ ፍየል ብራና አልቦ ስምና ከዳዊትም አንሣእኩን እፅፎ ይያዝ ቀኝ እግሩ እንዳይመነምን ያስፈራዋል የዚህ ፈውሱ የጠምበለል ቅጠል ጉመሮ ቀርሻሽቦ የበረሃ ግሜ ሥረ ብዙ የእነዚህን ሥሮችና የርግብ ሥጋ አንድላይ ሰልቆ አዋሕዶ በሌሊት ውሃ ዘፍዝፎ ጧት ጧት እስከ 7 ቀን ድረስ ይታጠብ ቢጠጣለትም ደግ ነው። ለዚህ ኮከብ ፀሮቹ ከመሬት ጀዲ ከውሀ ዓቅራብና ሸርጣን ናቸው ኮከብ ክፍሉ ቀውስ አሰድ ሰንቡላ ሑት ነው። ከዘመነ ሉቃስ ከወርም ጥቅምትና ሰኔ ከቀንም ረቡዕና ዓርብ አይሆነውም ሠኞና ሐሙስ ግጥሙ ነው በ80 አመቱ ሮብ ቀን በውጋት ይሞታል።\n\tገውዝ ነፋስ ኮከብ ያላት ሴት የሆነች እንደሆነ :- በሰው አገር ትከብራለች ትልቅ ጌታ ከሆነ ሰው ወንድ ልጅ ትወልዳለች ፊት ዝምተኛ ኋላ ግን ምላሷ ተናጋሪ አንደበቷ ሰው ደፋሪ ትሆናለች የኋላ ኋላ ጥቂት የደም ሕመም ያገኛታል አይነ ገብ ናት እጀ ሰብእ ይፃረራታል ልቧ ለሰው ይራራል ዓይንዋ ቀላ ቀላ ያለ ነው ጥቂት ዘመን በዘማዊነት ትታማለች ኋላ ግን ስጋዋ ቶሎ ይበርዳል የሰው ምክር ተቀባይ ናት በሆዷ ብርቱ ቂም ያዥ ናት የቤትዋ ስርአት ሞቅ ሞቅ አይልም ከአንገትዋ በታች ደም ግባታም ናት ሀብት አይጎልባትም ሰውነትዋ በራድ ነው በኩስኩስትና ሰሐን ንግድ ይሆንላታል ዕድሜዋ 60 አመት ነው።',
        'ሸርጣን-ውሀ/Cancer': '\tይህ ኮከብ በሰኔ 21 ቀን ከ3 ኮከቦች ጋር በምሥራቅ በኩል በዶሮ ጩኸት የሚወጣ ነው። ሸርጣን ነገረ ሰይጣን ይባላል በጃርትና በአጋዘን ይመሰላል ሸርጣን ውሀ ማለት የምንጭ ውሀ ማለት ነው ። ይህ ኮከብ ያለው ሰው ባህሪው ልዝብ ጭምትና አስተዋይ ነው ከአንገት በላይ ሰውን ይወዳል ለትልቅ ነገሮች ይታገሣል በትንሽ ነገር ይቆጣል ፍቅሩን አይጨርስም ከዳተኛና ውሸታም እምቢተኛ ነው ፈጥኖ ሰውን ይወዳል ፈጥኖም ሰውን ይጣላል ትልቅ ሀዘንና ደስታ በየጊዜው ይለዋወጥበታል ምክር ያውቃል ገንዘብ ወዳጅ ነው ራሱን ቢላጭ ይታመማል ሰውን ደላይ ወረተኛና ሸፋጭ ነው ተስፋ አይቆርጥም በስንት ተአምራት ከብዙ መከራ ይወጣል በነገረ ዝሙት የተነሳ እስራትና ግርፋት ያገኘዋል። ሥራ ወዳጅ ነው ገንዘብ በማጭበርበር በስጦታ በውርስ ይወጣል አይቆምለትም ከዘመዶቹ ጋር ጠብና ክርክር ያበዛል ነፍናፍ ኩርፍተኛ ነው መሓላ ይደፍራል ንግድና እርሻ ክፍሉ ነው ተንኮሉና መዘዙ ክፉ ነው ከፍ ባለ ወንጀል ተከሶ አደባባይ ለፍርድ ይቆማል ደረቅና እልከኛ ነው የሰው ምክር አይሰማም ለሰውም ደግ አይመክርም ቅንዝረኛ ነው ተንኮለኛ ነው። ያመሰገነው  ሰው ብቻ ያሞኘዋል የተናገረውን ሁሉ አዎን በሉኝ ባይ ነው ቅኔ ጽሕፈት  ተኩስ በገና ግጥም ዕድሉ ነው ጥቂት ጊዜ እሥራት ያገኘዋል። በሸንጎና ጉባኤ ህዝብን ለማስረዳት በቂ ንግግር አይሆንለትም ድምፁ ጉልህ ነው በዓይኑና ደረቱ በክንዱና በእምብርቱ ላይ ምልክት እለው ቂም የለውም ይቅር ባይ ነው የሰውን ብልሓት ለማስቀረት ንቁ ነው ኑሮውን ሁሉ ሚስቱ ታዝበታለች በሚስቱ ምክንያት ከዘመዶቹ ጋር ተጣልቶ ይለያያል መጠጥ ያበዛል ስካር ያሸንፉዋል ገንዘቡን ሁሉ ልጁ ያባክነዋል ልጅ ይሞትበታል ለዚህ ኮከብ ፀሮቹ ገውዝ ሰንቡላ ቀውስ ሑት የክፍል ኮከቦቹ ጀዲ ሚዛን ሐመል ናቸው። ከዘመነ ዮሐንስ ከወር ኅዳርና ታኅሣሥ ከቀንም ማክሰኞ አርብና እሑድ ያስፈራዋል ከ80 አመቱ በሁዋላ ድሀና ሴሰኛ ይሆናል ባርያ ዛር ያመዋል በልቡ ሳል ያድርበታል መነኩሴ ይሆናል ሥራይ ያስፈራዋል እሑድ ቀን ይጠንቀቅ ራቅ ካለ ሀገር አይሂድ ቀይ ሴት አያግባ የሰጠችውንም አይቅመስ በግራ እግሩ ምልክት አለበት በማርቆስና በዮሐንስ ይታመማል ሠናይ ወሩ ሰኔ እኩይ ወሩ ታህሳሳ ነው በታመመ ጊዜ መድሃኒቱ የርግብና የፌቆ ስጋ ከሰሊጥ ጋር አሰርቶ ይብላ መረቁንም ይጠጣ ጠጉራቸውንም አሳርሮ ይታጠን በ30 አመቱ ጋኔን ያየዋልና ደም ያገኘዋል ራሱን ወገቡን ያመዋል በፌቆ ብራና መስጥመ አጋንንትን አፅፎ ይያዝ። በግራ ጎኑ ደዌ ያድርበታል የዛር ውላጅ በአፍንጫው ደም ያነሥረዋል በሕልሙ ያስደነግጠዋል በ10 አመቱ ጉረሮውን ያመዋል መብረቅ ያስፈራዋል ማእሠረ አጋንንትና አስማተ ሰሎሞን አፅፎ ወንጌለ ዮሐንስንም አስነብቦ ይጠመቅ የጥቁር ወሰራ ዶሮ ቡሀ በግ ይረድ። ሠናይ እለቱ ሰኞ ሐሙስ ቅዳሜ እኩይ እለቱ ዓርብ ሮብ እሑድ ነው። ሠናይ ወሩ መስከረም ጥቅምት ጥር የካቲት ሲሆን እኩይ ወሩ ኅዳር ሚያዝያ ሀምሌ ነው የሱፍና የኑግ ቅባኑግ ከሰሊጥ ጋር ይጠጣ በምእራብና ምስራቅ ጠበል ይጠመቅ። በየካቲትና ታህሣሥ ለሞት የሆነ ብርቱ ጦርነት ያስፈራዋል። ቅዳሜ ቀን ደም አያውጣ መድሀኒትም አይጠጣ የዘመዶቹን ገንዘብ ይወርሳል የሴት አይን ያስፈራዋል ሆዱን አይኑን ያመዋል በጥር በየካቲት ቁስል ያገኘዋል በምንጭ በገደል የምትቀመጥ ሴት ጋኔን ትመታዋለች እርሷ ከዘማዊነቱ የተነሳ እንደ ቅናት እድርጋ ራሱን ሆዱን ልቡን እየቀሰቀሰች በቀኝ እግሩ እንደ ቁርጥማት ትገባበታለች ብልቱን እንደ ሽንት ማጥ እድርጋ አሳብጣ ታመዋለች በሕልሙ በድቀተ ሥጋ ትገናኘዋለች ለዚህ ሰው መድሃኒቱ የጥቁር ገብስማ ዶሮ በራሱ አዙሮ ያኑር ጉመሮ ጊዜዋ ጠምበለል ሥራቸውን ወቅጦ የዶሮዋን ክንፍ ጨምሮ ይታጠን ከእነዚህም ሥሮች በሌት ውሀ ዘፍዝፎ 3 ቀን ይታጠብ አስማተ ሰሎሞንን አፅፎ ይያዝ በ89 ወይም በ90 አመቱ በዘመነ ዮሐንስ ሮብ ወይም እሑድ ቀን በተፊአ ደም ይሞታል።\n\tሸርጣን ዉሀ ኮከብ ያላት ሴት የሆነች እንደሆነ :- አይነ መልካም ጥርሰ መልካም ናት ቤተሰብ አይስማማትም ነገር ታበዛለች ባልዋን ፈትታ በሰው ሀገር ትኮበላለች መድሃኒትና ደም ያስፈራታል ራስዋን አይኗን እጇን ሆዷን ያማታል ሐር ማተብና ብር ቀለበት ከአንገትዋ ባይለያት መልካም ነው። የጋላ ዛር ሌሊት ያስተዳድራታል ሰንበትን አቦን ስላሴን ተጠንቅቃ ታክብር ጠቋር በዶስ የሚባሉ ዛሮች ይመለከቷታል መድሃኒቷ የጥቁር ገበሎ ራስ  አንድ በቀል ፍየለ ፈጅ ጥቁር እዮባን መርበብተ ሰለሞንን በጥቁር ፍየል ብራና አንድላይ ፅፈህ አስይዛት ጋኔን ይጠናወታታልና በሜዳ ከወንድ ጋር እንዳትገናኝ ትጠንቀቅ።',
        'አሰድ-እሳት/Leo': '\tይህ ኮከብ በሐምሌ 26 በመስእ በኩል የሚወጣ ነው አሰድ እሳት የመብረቅ እሳት፣ አሰድ የያዘውን አይሰድ አሰድ ፀሐይ እንቁ ባህርይ ይባላል። በአንበሳ ይመሰላል። ይህ ኮከብ ያለው ሰው የፊቱ አወራረድ አንበሳ ይመስላል  ቁመቱ ድልድል ነፍሱ ንፁህ ከእናቱ ማህፀን የተመረጠ ልቡ የዋህ ገጹ ፍሡህ ጥርሱ ፍንጭት ነው ትልቅ ግርማ የአይን ሀይል አለው ጠላቶቹ ሲያዩት ይፈሩታል ይለማመጡታል በሴራ የመከሩበትን ሁልጊዜ ያፈርስባቸዋል ማናቸውንም ነገር ቢፊልግ ለማግኛት ይቻለዋል የገንዘብ ስሱ ነው ጥቂት ነገር ይበቃ አይመስለውም ቁጡ ነው ቶሎ ይመለሳል ጠላት ይበዛበታል ግን አይሸነፍም። እጅግ ምቀኛና ቀናተኛ ነው የሰውን ነውር ያወራል ኃጢያቱ ብዙ ነው በምጽዋት ይሰረይለታል ዘማዊ ነው ከዝሙት ብዛት የተነሳ አይኑን ያስፈራዋል ይሉንተኛና እንደበታም ነው መንፈሳዊ መስሎ መታየትን በሰው መመስገንና ከንቱ ውዳሴን ይወዳል በእጁ ጥፍር ከላይ ወደታች ጥቁር መስመር አለው ድንገተኛና አደገኛ ነው ምስጢርና ሴራ ክፍሉ ነው ስሙ በክፉ ይነሳል ውስጠ ደግ ወዳጁን ጠቃሚ ነው ዘመዱን አይጠቅምም ገንዘቡን ለባእድ ያባክናል ገፊ ነው ዘመድና ወዳጆቹን ከሸኘ በሁዋላ ብቻውን ይቀራል። ጊዜ ካነሳው ጋር ዉዳጅነት ይገጥማል ገንዘቡን ከሰው ገንዘብ ጋር ማቀላቀል አይሆንለትም ኃይለኛ በኃይሉ ተመካሒ ነው እርሻና ቤተ መንግሥት ክፍሉ ነው ሹመት ያገኛል ርኩስ ከብት ላም ንብ ይሆንለታል 3 ሚስት ያገባል ከሶስተኛይቱ ደግ ልጅ ይወልዳል ሐሙስ ቀን መሰናከል ያገኘዋል 2 ጊዜ እሥራት ያገኘዋል ግን በቶሎ ይፈታል ለጋስ ነው የትም ቢሄድ የሰው ፍቅር አለው ሰጥቶ አይመሰገንም ጠላቱን ይወዳል በሸንጎ ሲቆም አሸንፎ ይገባል ሰውነቱን እያሳበጠ ያመዋል ኮሶም እየደፈነ አያሽረውም እግዚአብሔርን ፊሪ አይነ ቅንዝረኛ ነው ጥቁር በግና ነጭ ዶሮ ይረድ ሰሊጥ አሳ ኤፍራን ቀለም በአንድላይ አሰርቶ ይብላ መረቁንም ይጠጣ ከፀጉሮችም 7 ቀን ይታጠን። ከእዳሪ ውድቀት የተነሳ ሕመም ያስፈራዋል ዓይኑን ራሱን ያመዋል ዓርብና ቅዳሜ ከሰውነቱ ደም አያጣውም መድሃኒት አይጠጣ መንገድም አይሒድ የሰው ገንዘብ አደራ አያስቀምጥ አጥፊው ነው ሚስቱ በደም ትሞትበታለች ሴት ጋኔን በወገቡ በልቡ እየገባች ታመዋለች 3 ጊዜ ገንዘቡ ይጠፋባታል። እርሱም እየታሰረና እየተፈታ ይኖራል ሲሳይ እያጣም ገንዘቡን ለዘመዶቹ መስጠት አይወድም ከሚሰጥ ቢሰርቁት ይወዳል ውሸቱን ነገር አሾክሹኩልኝ ይላል ልጆች ይወልዳል ጥቂቶች ይሞቱበታል ያልታወቁ ሰዎች ነጥቀው እንዳያጠፉት ያስፈራዋል በሓፍረተ ስጋው ላይ ምልክት እለበት በእግሩና በእራሱ የሰው አይን ያስፈራዋል ጫጫታ የምትባል ዋናው የዛር ውላጅ ትሸምቅበታለች በአይኑና በብልቱ ትገባዋለች ሌሊት በህልሙ ትገናኘዋለች ቀኝ እግሩን ጉልበቱን ወገቡን ራሱን ልቡን አይኑን እየላሰች ታመነምነዋለች  ለዚች መድሃኒቷ የቁልቋልና የሎሚ ተቀፅላ የአሜራ ስር ከርቤ ጨምሮ አንድላይ በአዳል በግ ብራና በነጭ ጨርጫቢ አፅፎ ከነዚህ መድሃኒቶች ጋራ አንድ ላይ ይያዝ።የመኖሪያ ክፍሉ ከተማ ቤተመንግስት ነው ማቴዎስና ማርቆስ ተከታታይ ዘመኖች ክፍሉ አይደሉም በነዚህ ዘመኖች ይህን ጽህፈትና እነዚያን ተቀፅላዎች የነጭ ወሰራ ዶሮ ደም እየነከረ በአመት በእመት እያነገሰ ይያዝ የውሀ ሙላት ያስፈራዋል ቅዳሜና እሑድን አክብሮ ተጠንቅቆ ይዋል ቀይ አረመኔ የሆነች ጋላ ሴት ያግባ ይወልዳል ይከብራል ኮከብ ግጥሙ ሠውር አቅራብ ደለዊ ነው ፀሩ ሑት ጀዲ ሸርጣን ነው። ማእከላዩ ሰንቡላ ቀውስ ገውዝ ናቸው መልካም ወራቶቹ ታህሳስና የካቲት ክፉ ወሩ ግንቦት ክፍ ቀኑ አርብ ነው በ10 በ24 በ40ና በ30 አመት ያስፈራዋል። በማቴዎስ ወይም በማርቆስ በሰኔ ወይም በነሐሴ አርብ ቀን በ99 አመቱ በድንገት ይሞታል። \n\tአሰድ እሳት ኮከብ ያላት ሴት የሆነች እንደሆነ :- መኳንንት ያፈቅሯታል አካልዋ ንፁህ ጥርሰ መልካም ናት ዘማዊነት አለባት ጥቁር ሰው ክፍሏ አይደለም አጥፊዋ ነው የቂጥኝ እግል ያስፈራታል በመስከረምና ጥቅምት አርብና ቅዳሜ ቀን እሩቅ ሀገር አትሒድ ትጠንቀቅ አንድ ከወለደች በሁዋላ ማህጸንዋ ቶሎ ፍሬ አይዝም እንደ መካንነት ይከጅላታል ወንድ በመኝታ ያፈቅራታል የቤት አያያዝ ታውቃለች መብልና መጠጥ ትችላለች ለቤተሰብ መልካም ደግ የዋህ ናት የጥቁር ሰው አይን ያስፈራታል የእጀ ሰብእ መድሃኒትና ጨርጨቢ አፅፋ ትያዝ።',
        'ሰንቡላ-መሬት/Virgo': '\tይህ ኮከብ በመስከረም 7 ቀን ከሁለት ከዋክብት ጋር ከሌሊቱ በሰባት ሰአት ከወደ ፀሓይ መግቢያ የሚወጣ ነው ሰንቡላ መሬት ቅልቅል መሬት ማለት ነው ሰንቡላ የሰው ይበላ ይባላል በጉጉት አሞራ ይመሰላል። ይህ ኮከብ የአለው ሰው በብዙ እንኳ ባይሆን ከግምባሩና ከቅንድቡ አወራረድ የ አይን ኪርትሱ የ ጉጉት ምሳሌ ይገኝበታል። ሌሎች የደከሙበትን ገንዘብ ለመውሰድ ሰብሳቢ እድል አለው ምክሩ ዘሊቅ ነው ለሰው ይተቅማል ኑሮው በ አግባብ ነው ዉሸታምና ጉረኛ ነው መጀመሪያ ይደነግጣል እየቆየ ግን ደፋርና ልበ ሙሉ ይሆናል የተገባ ምክር የነገር ምላሽ ያውቃል በተወለደበት አገር አይኖርም በቀይ ቦታ ይኑር ነጭ ነገር ክፍሉ ነው ከዘመዶቹ ጋር አይስማማም በነገር አይረታም ሕልሙ እሙን ነው ቶሎ ይደርሳል ሲሳየ ብዙ ነው ሰውን ማሞኘት ይችላል አጭበርባሪና ብልጥ ነው ክፍሉ ከተማ ነው ገጠር አይሆነውም ሹመት ያገኛል  ሳቅ ያበዛል እግዚአብሔርን ያምናል ጸሎቱ ሥሙር ነው በጊዜ ወደ ቤቱ መግባት አይሆንለትም ያልደረሰበትና የማያውቀው ሀገር የለም ፊቱን ትክ አርገው ቢያዩት አይችልም ፊቱን ያዞራል ከትልቅ ሰው ጋር ሲነጋገር ይጃጃል የአሰበውን ትቶ ያላሰበውን ይናገራል የሰው መውደደ አለው ስጦታና ሽልማት ለማግኘት እድላም ነው ተልኮ ጉዳይ ማከናወን ይሆንለታል በዘንግ ቁሞ አይችልም ተቀምጦ ሲመክር ዓዋቂ ነው። ሰፊ ዝና አለው ከሰው ጋር በቶሎ አይላመድም ሰላማዊ እንኳን ቢሆን ነገር ወዳለበት ፈልጎ ይገባል ያሰበውን ትቶ ያላሰበውን ይነገራል ወዲያው ደግሞ ይፀፀታል በብዙ ነገር እድለኛ ነው ነገር ግን እድሉን በገዛ ራሱ ያጠፋዋል ወደ ኋላ ጊዜው ጥቅሙን አባራሪ እንጀራውን ገፊ ይሆናል የሕፃን ሽማግሌነቱን በወራዳነት ይለውጠዋል የጠላቶችን መውደቅ ያያል ቅንዝረኛ ነው ኃያል እልከኛ አትንኩኝ ባይ ቶሎ ተቆጭ ነው ነገር ግን አጭሮ አይጣላም ልጆች ይወልዳል ሰውን ማማት ይጠላል ጠላቱ ብዙ ነው ፊቱ ክፍት ይላል ድምፁ ከባድ ሆኖ ብትን ነው ሴት መድኃኒት ታበላዋለች በ27 ዓመቱ መቅሰፍት ያስፈራዋል ጭኑን ይቆረጥመዋል እራሱን ብልቱን ወገቡን ሆዱን እየነፋ ያመዋል መድሃኒቱ ነጭ ወይም ቀይ በግ አርዶ በደሙና በፈርሱ ይታጠብ ዓሣና ሰሊጥ በዛጎልማ ዶሮ አሰርቶ ይብላ መሩቁንም ይጠጣ። ለሆዱ በሽታ ደግሞ የበግ ላትና ደረቅ ጠጅ ቁንዶ በርበሬ ኤፍራን ቁለም የአሞሌ ጨው አንድ ፅዋ ቅባኑግ ነጭ ሽንኩርት በቶፋ መርጎ ሶስት ቀን ከበላዩ እሳት አንድዶ ማር እየበላ ይጠጣው።በነጭ በግ ብራና ፀሎተ ንድራ ትምህርተ ህቡዓትና መስጥመ አጋንንትና አፅፎ ይያዝ።የምስርችና የፍየለ ፈጅ የግዛዋና የቋራ አረግ በአዲስ ቅል ዘፍዝፎ ኪዳንና ትምህርተ ኅቡአትን አስቀድሞ ይታጠብ። ከዘመነ ማርቆስ ከወር ታኅሣሥና መጋቢት አይሆኑትም በጥርና ሰኔ ድንገት በሽታ ያገኘዋል ለዚህ መድኃኒት ጭቁኝ ነጭ ሽንኩርት ቁንዶ በርበሬ ጫት ቡና አንድላይ እያፈላ እስከ ሰባት ቀን ይጠጣ ዕጣን ያጢስ ኮከቡ አምልኮ ይወዳል የቀይ ከላድማ ፍየል ወይም ቀይ በግ ጭዳ ያድርግ ከሚፈላው መድኃኒት አትርፎ በቀይ ዶሮ ደም ነክሮ ክንፉን ጨምሮ ሶስት ቀን ይታጠን ።በበግ ብራና ማእሰረ አጋንንትና አራቱ ኤኮሳትን ሱስንዮስን ጸሎተ ንድራን አልቦ ስምን አይነ ወርቅና አስማተ ሰሎሞንን አፅፎ ይያዝ የዘመድ ጠላት በፍየል ስጋ መድሃኒት ያደርግበታል በዘመነ ማርቆስ ሮብ ቀን በ47 ዓመቱ በጭንቅ ይታመማል። እስከ ሞት ይደርሳል ወደ ፈጣሪው አጥብቆ የለመነ ያዘነ የተከዘ እንደሆነ ግን ዘመኑ 89 ይሆናል። ፀር ኮከቦቹ ሐመል ደለዊ አሰድ ናቸው ግጥሙ ቀውስ ሑት ገውዝ ማእከላዩ ሚዛን ጀዲ ሠውር ናቸው። ክረምት ይሆነዋል የሰው ገንዘብ ይገባለታል ጥቁር ነገር አይወድለትም ግጥሙ ቀይ ነገር ነው እጀ ሰብእ ይፃረረዋል ከዛሮቹ ብር አለንጋ ከውላጅ መቅረጭ ዋስ አጋች ይመለከቱታል ከአውሬና ከቁስል የተነሳ ያስፈራዋል ክፍለ ጭዳው ቡሀ በግ ቀይ በግ ነው። አርብና ሮብ አይሆኑትም ሰኞ ማክሰኞ ሐሙስና ቀዳሜ ግጥሙ ነው ።የሚሆነው ፈረስ ዳማ ሶቄ ቃጫ ቦራ ነው ።\n\tሰንቡላ መሬት ኮከብ ያላት ሴት የሆነች እንደሆነ :- ዓይነ ዘማ ቅንዝረኛ ለሁሉ እሺ ባይ ወራዳ እግረ ቀጭን ትኩሳታም ትሆናለች ትካዜ ይገባታል ዓለማዊ በካና ናት አይሞላላትም ምላሷ ተናጋሪ አፈ ደረቅ ዓቅሟ ደካማ ቀናተኛ ናት። ሕመም አያጣትም ነገር ግን አይበረታባትም ዓይነ ጥላ ጋርጋሪያት አለባት በቀይ በግ ብራና አልቦ ስምን አፅፋ ትያዝ ጥቁር ፍየል አሳርዳ ደሙን ቁድታ ከባህር ዳር ይዛ ሂዳ ትታጠብበት ትንሽ ቆየት ብላ በውሃው ትለቅለቅ መብል መጠጥ ትሰጣለች ገንዘብ አትሰጥም ትነፍጋለች ዓይንና ጥርስዋ መልከመልካም ናት ወንድ መኮንን ይወዳታል ቃለ ልስልስ ናት ሆዷን ጎኗን ያማታል ሥጋ ስትበላ የሰው አይን ያስፈራታል ትጠንቀቅ።',
        'ሚዛን-ነፋስ/Libra': '\tይህ ኮከብ በጥቅምት u ቀን በመንፈቀ ሌሊት በዐዜብ በኩል ይወጣል በተኩላ ይመሰላል ሚዛን ነፋስ እህልና ገለባ የሚለይ የቀትር ነፋስ ማለት ነው አጉረምራሚ እንደ ነብር ነጭናጫና ነጣቂ ነው። ይህ ኮከብ ያለው ሰው ሰውነቱ ቁጡ ምላሰኛ ጠላቱ ብዙ ሃይማኖቱ ብርቱ ነው ኑሮው በኅዘን ነው መላና ምክር ዓዋቂ ነገር ተርጓሚ የሰው ልብ ገማች ትምህርት መርማሪ ምሥጢር ዓዋቂ ነው ሙግት ዕድሉ ነው ጠላቶቹ ይፈራሉ ይደነቃሉ ይሸበራሉ ግርማ ሞገስ አለው በድንገት መልስ ለመስጠት እድለኛ ነው በሰው ሐሳብ ይመራል በግምባሩ ምልክት አለው ኮከቡ ዘዋሪ ነው አያርፍም ዘመዱን ይጠላል  ባዕድ ይወዳል አእምሮው ብሩህ ነው መጭው ነገር ይገለጽለታል ቤተ መንግሥት ክፍሉ ነው ሹመትና ንግድ ክፍሉ ነው ንዳድና የኮሶ ምች ያስፈራዋል ልቡ ብሩህ ጭምት ነው የተማረውን አይረሳም። ለሰው ቅን ነው በቃሉ ደስ የሚያሰኝ ይመስላል ለመብል እሱር ንፉግ ነው ብዙ ጉንዘብ ያገኛል አይሰጥም ለልጁም ቢሆን ከቶ አይሰጥም ገንዘቡ ለባዕድ ይሆናል በእጁ በረከት የለውም አምልኮኛና መሐላ ፈሪ ነው ድሃ አይወድም ከትልቅ ሰው ጋር ሳቅ ጨዋታ ያበዛል ተቀያሚ ኩርፍተኛ በፍርድ አድሏዊ ሰው አቅላይ ነው። የተመሰገነ ታሪክ ይኖረዋል አገር ላገር በመዞር ሀብት ይሆንለታል ገንዘቡ በእድሜው እኩሌታ ያልቃል። የድውይ መፈወስ ስጦታ በእጁ አለው አይታወቅበትም እንጂ ምቀኛና ሐሜተኛ ነው በመብል ጊዜ ጉምጁና ሆዳም ነው የጆሮ ቁስል ያስፈራዋል በዓይኑ ዘማዊ ነው አውስቢ ይወዳል ቀይ ሴት አግብቶ ሰባት ልጆች ይወልዳል ትልልቅ የሆነ ነገር ያስባል ከፍፃሜ ግን አይደርስለትም ለዛ ያለው ንግግርና ደስ የሚያሰኝ ጨዋታ ያውቃል ስሙን ለማጥፋት ብዙ ጠላቶች ይነሱበታል ነገር ግን በተንኮላቸው ዝናውንና እውቀቱን ስሙንና ታሪኩን እጅግ ከፍ ያለ ያደርጉታል በድንገተኛ ነገር  ድንጉጥና ፈሪ ነው እስራት ያገኘዋል ቤቱ ይወረሳል ይበዘበዛል በዓርብ ቀን ትልቅ አደጋ ያገኘዋል ስለ ሰው መሥዋዕት ሁኖ ሊያልፍ ይወዳል ንግድ ከብት ማርባት እርሻ ክፍሉ ነው ከ50 አመት በሁዋላ ባለ ፀጋነቱ እንደገና ይመለስለታል ፍጻሜው በትዳሩ እንዳማረለት ያልፋል። በግራ እግሩና እጁ ምልክት አለበት ቁስል ይገኝበታል የግራ አካላቱን ያመዋል በዓይኑና በልቡ ዛር አይቶታልና ዓይኑ ይፈዛል። ከጥቁር ሴት ቂጥኝ ያስፈራዋል በጥቁር ሰው የተነሳ አምባጓሮ ያስፈራዋል በዚሁ ምክንያት ከደንቃራ  ይገባና ይታመማል ድርጎ የሚባል ዛር ከሰው ተጋብቶበታልና ጽኑ በሽታውም የራስ ምታት ነው የሚብሰውም እሑድ ቀን ነው በዘመነ ሉቃስ የደብረ ታቦር ዕለት ያስፈራዋል  በ40 አመቱ በጦርነት ይቆስላል  ራሱን ቀይ ሰው ቢያክመው ይሻለዋል። ለዚህ መድሃኒቱ የሰው ሰለባ አዝሙድ የጥቁር ውሻ ኩስ ሰባት ቀን ቢታጠን ይድናል በ30 አመቱ በቀኝ እግሩ እንደ ቁርጥማት ያመዋል ለዚህ መድሃኒቱ በነጭ ፍየል ብራና ኤኮስንና አካስን ጌርጌሴኖንና አልቦ ስምን አፅፎ የሸላ ሥጋ ጨምሮ ይያዝ በጥቁር ገብስማ ወይም በነጭ ዶሮ ጭዳ ብሎ ሥጋውን በሰሊጥ አሰርቶ ይብላ በሐዘን ምክንያት ሕመም ያገኘዋል የሰባ ስጋ ሲበላ የሰው አይንና የዛር ውላጅ  ያየዋል ወገቡን ጎኑን ሆዱን መላ አካላቱን እየከፈለ ያመዋል ይህ ሕመም ያስፈራዋል ይጠንቀቅ እኩይ ወሩ መጋቢት ሰኔ ነሐሴ ሠናይ ወሩ ጥቅምትና ሐምሌ ነው እኩይ እለቱ ሮብ ዓርብ እሑድ ሠናይ እለቱ ሰኞ ማክሰኞ ሐሙስ ነው። ጋብቻው ሐመል ጀዲ ናቸው ሸርጣንም ኅብሩ ነው ኮከብ ፀሩ ሑት ሠውር ሰንቡላ አይሆኑትም ቀይና ነጭ ነገር ክፍሉ ነው መርበብተ ሰለሞንና ኤኮስን እፅፎ ይያዝ። አጋጣሚው አሰድ ጀዲ ሑት ነው ማእከላዩ  ደለዊ አሰድ ናቸው።በዘመነ ሉቃስ ወይም በዘመነ ማቴዎስ ነሐሴ እሑድ ቀን የደብረ ታቦር ዕለት በ85 ወይም በ70 አመቱ ይሞታል።\n\tሚዛን ነፋስ ኮከብ ያላት ሴት የሆነች እንደሆነ :- በዘመኑዋ ሁሉ ታማሚ በሽተኛ ራስ ምታትና የሆድ ሕመም አይለያትም እንደ ሥራይ ሠርቶባታል ሆዱዋን እየበላ ያመነምናታል ዘመዶቿ መድሃኒት ያቀምሷታል ምቀኛ ይበዛባታል በፊት ገንዘብ ታገኛለች ትከብራለች ደግ ልጅ ትወልዳለች የኋላ ኋላ ግን ችግር ያገኛታል የመርገም ደም ይመታታል ብርቱ ዛር ያድርባታል በሽታዋ ወደ ጣዖት ያሰግዳታል በመጨረሻ ዘመን ግን በንስሀ ወደ ፈጣሪዋ ትመለሳለች ለንብረትዋ ልባም ናት ፀጉሯ ለስላሳ ረጅም ነው ዝሙትነት አለባት መብልና መጠጥ ትወዳለች ልጅም የምትወልደው ወደ ኃላ ቆይታ ነው ከጥቁር ሰው ጋር መገኛኘት አይሆናትም ክፍልዋ ቀይና ነጭ ነው።',
        'ዓቅራብ-ውሀ/Scorpion': '\tይህ ኮከብ ኅዳር 8 ቀን ከስምንት ከዋክብት ጋር በመንፈቀ ሌሊት የሚወጣ ነው አቅራብ ውሀ ግድብ ውሀ አዘቅት ማለት ነው በነብርና ዝሆን በጊንጥም ይመሰላል።ይህ ኮከብ ያለው ሰው ወዳጅና ጠላቱን አስተካክሎ ይወዳል ገራምና ለጋስ ነው ሰጥቶ አይመሰገንም ቁጡ አትንኩኝ ባይ ጨካኝ ዘማዊ አባይ ነው ጸሎቱ ይሰምርለታል ከፍተኛ ባህርይና የተሰወረ ሚስጥር አለው መሠሪ ነው የወጠነውን ነገር ሁሉ ከፍፃሜ ለማድረስ ይሆንለታል ብዙ ጠላቶች ይነሱበታል ብዙ ትግልና ፈተና ይደርስበታል የጠላቶቹን ወጥመድና ተንኮል ቆርጦ ይጥላል ብርቱ ኃይለኛ ነው የጠላቶቹን መውደቅ ያያል ደስተና ሃዘን መውደቅና መነሳት ሀብትና ድህነት ይፈራረቁበታል እንደ ነብር ዘወትር ጠርጣሪና ንቁ ቁጥብ ነው እንቅልፍ እስኪከለክለው ድረስ ከፍ ያለ ሃሳብና ምኞት አለው። በአርባ አመቱ ዓይኑን ይጋርደዋል በእጁ ነፍስ ያጠፋል ለኩነኔ የተገባ ነው ልቡ ክፉ ቂም ያዥ ተበቃይ ነው ከወደደ በቶሎ አይጣላም ከአልመነኮሰ አይፀድቅም በ50 አመቱ የመነኮሰ እንደሆነ ምሥጢረ እግዚአብሔርን ለማየት ይበቃል ሀብቱ እንደገና ይፈላል ሰባት ልጆች ይወልዳል ጥቂቶቹ ይሞቱበታል በጎልማሳነቱ ዘመን እግዚአብሔርን እንኳ  አልፈራም ይላል አንደበቱ ደፋር ልቡ ጨካኝ ነው በሀሰት ሰውን ይረታል ትጉህ ጸላይ ነው የአባቱንና የእናቱን ገንዘብ ይወርሳል እጀ እርጥብ ሲሳያም ነው ራት አያጣም ፍፁም ክፍሉ እርሻና የእጅ ስራ ነው ሌሊት በሀሳቡ ሁሉን ሲያከናውን ያድራል መሬት ሲነጋ ግን የሚጨበጥ ነገር የለውም ምሥጢሩ ለብቻው ነው ለሰው ማታለል መሸንገልና መደለል እድሉ ነው ባንደበቱ ደግ ባለንጀራ ይመስላል ነገር ግን ልቡ ከዳተኛና ተንኮለኛ ነው። ኃይለኛና ኩሩ ነገር ወዳጅ ወረተኛ ሀሰተኛ ዓይነ ደረቅ ነው በተወለደበት ሀገር አይደላውም በሰው ሀገር ይሾማል ክፍ ቃል ቢናገርም ይደነቅለታል ስለ ጥቅሙ ሲል ይታገሳል እንጅ  ቁጣ ባህሪው ነው የሚበልጠውን ሰው ሲያይ አይኑ በቅናት ደም ይለብሳል ትዳሩ ይሰናከልበታል አጋጊጦ መታየት ይወዳል ገንዘብ ያባክናል ለጋስ እየተባለ ሊመሰገን ይፈልጋል ከሰላሳ አመቱ በሁዋላ ጠባዩ ይለወጣል ንፉግ ቆጣቢ ይሆናል ማንንም አያምንም ጠርጣሪ ሞገደኛና ተከራካሪ ነው ለሚስቱ ምቹ አይደለም ግምባሩ ገፊ ነው ቤተ ሰዎቹን ይሸኛል ግራ እግሩን ያመዋል ከፈረስ ወድቆ መሰበር ያስፈራዋል አንድ ጊዜ ከትልቅ ፈተና ይገባል ይህን ፈተና ዘልቆ ግን ከትልቅ ደረጃና ማእረግ ይደርሳል ለዘመዶቹ ረጂና  መመኪያ ይሆናል በሽምግልና ዘመኑ ዘመዶቹንና ወገኖቹን ይጠቅማል ። ሌጌዎን የሚባል ጋኔን በፊትና በሁዋላ ይከተለዋል ከሴት መድሀኒት ይጠንቀቅ  ቡዳ ቁስል ቁርጠት ቁርጥማት ያመዋል ሚስቱን በደም ያስፈራታል እጁን እግሩን ራሱን ያመዋል ከዘመነ ማርቆስ ወደ ዘመነ ሉቃስ ሲሻገር በመጋቢት ሮብና ዓርብ ቀን የምታት በሽታ ያገኘዋል መድሃኒቱ የዶሮ ኩስ የሚባል ዕፅ ጉመሮ የእርግፍጋፍ የእነዚህን ሥር ሰባት የጊንጥ ራስ የምጥማጥ ሥጋ የፍየል ቀንድ አንድላይ ቀምሞ ሶስት ቀን ይታጠን። ከእነዚሁ መድሀኒቶችም ቀንሶ በአምሳያ(ላሚቱ እናትና ልጅ እንድ ፀጉር) ቅቤ ለውሶ ሰባት ቀን ገላውን ያባብስ።ግንቦትና ጥቅምት ህመም ያስደነግጠዋል መድሃኒቱ ጉመሮ ጊዜዋ ምስርች ይታጠን።በጥቁር ፍየል ብራና ሀፁረ መስቀልና ቆጵርያኖስን አፅፎ ጊንጥ ጨምሮ ይያዝ ዓሣና ሰሊጥ አብስሎ ይብላ አጥንቱንም አንቀፀ ብርሃን አስደግሞ ይታጠን የቀረጥ ተቀፅላ ይያዝ። በተወለደ በሁለት ፣በአርባ አምስት እና በሰላሳ አመቱ ብርቱ ሕመም ያስፈራዋል መድኃኒቱ ጥቁር ዱልዱም ዶሮ ወይም ጥቁር የገብስማ ዶሮ ጭዳ አድርጎ የቅድሙን መድሃኒቶች በዶሮው ደም ነክሮ ከትቦ ቢይዝ ደግ ይሆንለታል። ሠናይ ወሩ መስከረም ኅዳር ታኅሣሥ ጥር ነው እኩይ ወሩ ጥቅምት የካቲት መጋቢት ሠናይ እለቱ ሰኞ ማክሰኞ ሐሙስ እኩይ እለቱ ዓርብ ሮብ ነው።ኮከብ ፀሩ ሓመል ገውዝ ሚዛን ነው ግጥሙ ደለዊ ሠውር አሰድ ማእከላዩ ቀውስ ሸርጣን ሰንቡላ ናቸው።በዘመነ ዮሀንስ በጥቅምት ወር እሑድ ቀን በ77 አመቱ ይሞታል ያዘነ የተከዘ የጸለየ እንደሆነ ግን እስከ ___ይቆያል። \n\n\tአቅራብ ኮከብ ያላት ሴት የሆነች እንደሆነ :- ማህፀንዋ ስፉህ ነው ብዙ ልጆች ትወልዳለች ሾተላይ ይፀናወታታል ከጋኔን የተቀላቀለ የዛር ውላጅ ይመለከታታል ልጆችም ይሞቱባታል ለጊዜው ቁጡ እኩራፉ ሆደ ባሻ ገር ናት ኃላ ግን ቻይ ቶሎ ተመላሽ ናት ሀብቷንም ፊት አሳይቶ ኃላ ያጥርባታል ጉርሻ ትወዳለች ደረቅ ናት። ነገርዋ ለሰው አይጥምም ፊተ ረጅም ናት ቅንዝረኛነት አታጣም ከእግሩና ከክንፉ ጥቁር ያለበት ነጭ ዶሮ ጭዳ ታድርግ በጥቁር ፍየል ብራና ሓፁረ መስቀል አፅፋ ትያዝ ዕድሜዋ 85 አመት ነው።',
        'ቀውስ-እሳት/Saggitarius': '\tይህ ኮከብ ከ8 ከዋክብት ጋር በታኅሣሥ 11ቀን በዕርበተ ፀሓይ የሚወጣ ነው። ቀውስ እሳት ረመጥ ወይም የተዳፈነ እሳት ይባላል በጅብና በአውራሪስ  ይመሰላል:: ይህ ኮከብ ያለው ሰው ደስታውንና ሓዘኑን ጥቅሙንና ጉዳቱን ለሰው አይነግርም ምሥጢሩ ሁሉ ሥውር ኃይሉ ድብቅ ጻድቅ መንፈሳዊ እግዚአብሔርን አማኝ ፊሪ ጾሙና ጸሎቱ ሥሙር ነው ብቸኝነትን ይወዳል ልቡ ቅን ነው ባለቤቱ ትሞትበታለች ወይም ትፈታዋለች ገርና ቅን ሰው  አማኝ ነው በገርነቱ ትዳሩን ያሰናክላል ሓሳብ ያበዛል አይፉፀምለትም ነገር ይረዝምበታል ቶሎ አይቆረጥለትም ቁም ነገራምና ትንቢተኛ ይሆናል አስቀድሞ እንደሚያሸንፍ ሳይገምት በቶሎ ለጠብ አይነሳም በሰው ነገር ዘሎ አይገባም ገርነት አለው ራሱን አኩሪ ተመካሒ ብልህ ጥበብ አዘጋጅ ለሴት ገራምና የዋህ ነው በትንሽ ነገር አዝኖ በትንሽ ነገር ይደሰታል ጥፋትና ስህተት ሞልቶታል።አይነሳም እንጂ ከተነሳ እንኳን ሰውንና ፈጣሪውንም ይደፍራል ከያዘ አይለቅም አይኖቹ ልሞች ናቸው ድምፁ ለሰው ደስ የሚያሰኝ ነው በቤተ መንግስት ይኑር ቀይ ነገር ክፍሉ ነው ከጥቁር ከብት ወድቆ ይሰበራል በዓይኑና በፊቱ ልዩ ምልክት አለበት ብዙ ልጆች ይወልዳል አብዛኞቹ ሴቶች ይሆናሉ ሶስት እድል አለው ከሶስቱ አንዱን እንኳን ቢይዝ ሃብታም ይሆናል አንዱን ካልያዘ ግን ተራ ሰው ሁኖ ይቀራል።ሰው ያማዋል ሐሜት ልብሱ ነው ቀጠሮ አፍራሽ ነው በሴቶች ዘንድ ተወዳጅ ነው እድፋም ልብስ አይሆነውም ዘወትር ነጭ ይልበስ ሰው ሁሉ ይፈራዋል ገራም ነው የኋላ ኅላ ምንኩስና ክፍሉ ነው የሽንት ምጥ ያስፈራዋል።ብዙ ምቀኞች ይነሱበታል ያባርሩታል ሥራውን ያሰናክሉበታል ነገር ግን በማሰናከላቸው ይጠቀምበታል ብርቱ ነኝ ባይ ነው ነገር ግን ዘወትር ወዳጆቹ ያሸንፉታል ዘመዶቹ አይወዱትም እርሱም ከዘመድ ይልቅ ባዕድን ይጠቅማል ነገር ይቆሰቁሳል የቆሰቆሰው ነገር እስከ ዳር ሳይደርስ አያርፍም ቀይ ነገር ክፍሉ ነው በቀይ ቦታ ይኑር ለጤናውና ለኑሮው በገጠር ይመቸዋል ክፍሉ ግን ከተማ ነው በምስራቅ በኩል ይኑር ።ንዳድ ያስፈራዋል አይንና ጥርሱን እንደቁርጥማት ያመዋል እንጀራው በሽበት ነው ነጭና ቀይ በግ ዳለቻ ፍየል ይረድ የዐማኑኡልን ፀበል ይጠጣበት። በ2 ወይም በ12አመቱ የጉረሮ ሕመም አለበት የቡያ የርግብ የምጥማጥ የሸላ የፍልፈል ስጋ ሥረ ብዙ ዳብዛ ፅጌረዳ ሥራቸውን ከእነዚያ ስጋዎች አንድላይ ደቁሶ ይታጠን።በማቴዎስ እስራት ያስፈራዋል በመስከረምና ታህሳስ የካቲት ነሐሴ ዓርብ ሮብ ይጠንቀቅ ክፉ ነገር ያገኘዋል መብረቅ ያስፈራዋል በዘመነ ዮሐንስ ቅዳሜ ቀን ይሾማል በሰላሳ አመቱ መቅሠፍትና የሰው ልሳን ጭምር ያስፈራዋል ነገር ባሰበ ጊዜ ልቡ ይዘራል በእግሩና በእጁ ምልክት አለበት በዘመነ ማቴዎስ ሰኔ 12 ቀን እንቅፋት ያገኘዋል ጥቁር ፍየል ይረድ ዓሣ በሰሊጥ አሰርቶ ይብላ በታመመ ጊዜ ነጭ እጣን ሎሚ የዓሣና የከርከሮ ሥጋ ቀቅሎ ይብላ መረቁንም ይጠጣ።በተቆጣ ጊዜ ጀርባውን ያመዋል ሐሳብ ያበዛል ነቀርሳ ያስፈራዋል መድኃኒቱ የአሜራ ስር የዋንዛ ስርና ቅርፊት አሳርሮ በቅቤ ለውሶ ከሚያመው ላይ ያድርግ በሰኔ ወር እንደ ሳል ያመዋል ያርክ የሚባል አስማት ኤኮስን ጨምሮ በነጭ ዶሮ ፊኛ ፅፎ ይያዝ።እጁን ቁርጥማት ያመዋል አይነ ጥላውን በነጭ ፍየል ወይም በነጭ በግ ብራና አልቦ ስምና አራቱን ኤኮሳትን ሱስንዬስና ፀሎተ ንድራን አፅፎ ከነዚያ ከተፃፉት ሥሮችና ሥጋዎች ቀምሞ ከዓይነ ጥላው ጋር ይያዝ::የሚመለከቱት ዛሮች ቆስጤ ጅጅኖ ከውላጅም ኩርንችትና በጣሳ ናቸው በቀኛና በግራው እየተዘዋወሩ ያበሳጩታል ሴት ዛር ታድርበታለች ዓይኑን ትተናኮለዋለች ደም አስመስላ ታፈዝበታለች እግሩን ራሱን ጫንቃውን ልቡን ያመዋል ጆሮውንም ያደነግዘዋል ለዚህ ሁሉ አስቁድሞ የተጻፈውን ሙድኃኒትና ዓይነ ጥላውን ቢይዝ ይሻለዋል ጭዳው ዳለቻ ፍየል በግ ዶሮ ነው ክፍለ ፈረሱ ቡላ ሐመር አፈ ሾሌ ቡላ በቅሎም ይጫን። እኩይ እለቱ ሐሙስና ቅዳሜ ነው ሠናይ ዕለቱ ረቡዕ ዓርብ እና እሑድ ነው። በዘመነ ማቴዎስ የሰኔ ተክለ ሃይማኖት እለት ያስፈራዋል። ጋብቻው ሑት፣ሰንቡላ እና ገውዝ ናቸው። ፀሩ ሸርጣን፣ ሰውር እና አቅራብ ናቸው። ማእከላይ ጀዲ ሐመል እና ሚዛን ናቸው። በዘመነ ማቴዎስ በ88 ዓመቱ ቅዳሜ ቀን ይሞታል።\n\n\t ቀውስ እሳት ኮከብ ያላት ሴት የሆነች እንደሆነ :- ላይዋ መልካም ነው ደም ግባት አላት ሳቂተኛ ትሆናለች ዓይነ ዘማ ናት ሆዷ ቂመኛ ነው ግን በቶሎ ትመለሳለች የሰውን ባህርይ መጣኝ ልበ ብልህ ናት ልክ ዐዋቂ ቤቷን ወዳጅ ወዳጅዋን አፍቃሪ ቁም ነገራም ናት ደጋግ ልጆች ትወልዳለች ሆዷን ልቧን ዓይኑን ያማታል በወሊድ ደም ያገኛታል የርግብ ሥጋ በሰሊጥ አዘውትራ ትብላ። በደም ግባቷ ትመካለች ጥርሰ መልካም ናት ማን ይበልጠኛል ትላለች እድሜዋ 80 አመት ነው።',
        'ጀዲ-መሬት/Capricorn': '\tይህ ኮከብ በሐምሌ ወራት በምሥራቅ በኩል በመንፈቀ ሌሊት ይወጣል። ኮከብ ጀዲ በንስር ወይም በሸረሪት ይመሰላል ጀዲ መሬት ደባይ(ዋልካ) መሬት ማለት ነው  ጀዲ ነገረ ወዲ ይባላል። ይህ ኮከብ ያለው ሰው እንደ ንስሩ ፈጣን ነው ፍርሃት የለውም አደጋ ጣይ ጨካኝ ኩርፍተኛ ባለንጀራውን አክባሪ ጨዋታ ወዳጅ ነው ወዲያው ካልተበቀለ ቂም አይዝም  ጽሕፈት መሰንቆ የጌታ ቤት እርሻ ክፍሉ ነው በደባይ በጥቁር መሬት ይኑር ነጭ ከብት አፈ ጭቃ ፈንዝማ ይረባለታል በሰው ዘንድ አይለማመጥም ዝምተኛ ነው  ብቸኝነት ይወዳል ራሱን ማዋረድ አይወድም ግን ሰው ይወደዋል ለሰው ከቶ አድልዎ የለውም ቀጥ ያለ ሐቀኛና እሙን ነው ትንሽ እልክ አለበት በእልኩ ከትልቅ አደጋ ይደርሳል ክፍሉ ጠይም ሰው ነው ስንደዶ ከሚበቅልበት ቦታ ይኑር ልበ ብሩሕ እግዚአብሔርን ፈሪ ሕልሙ የታመነ ነው ከፍ ያለ ማሰብ አለው ስጦታው ነውና የእጅ ስራው ይደነቃል በምቀኞች ብዙ ጊዜ ይንገላታል ይቀኑበታል ይመክሩበታል በመጨረሻ ግን ያሸንፋል አትክልትና እርሻ በጥቁር መሬት ይሆንለታል ተጸጻች ምህረተኛ ቸር ይቅር ባይ ነው ምቀኛና ሌባ አንድ ጊዜ ንብረቱን ይዘርፉታል በልቡ ትቢት ያበዛል  እስከ ዘመነ ሽምግልናው ድረስ እጅግ ዘማዊና ቅንዝረኛ ነው በሴት ነገር ተከሶ በፍርድ ቤት ይቆማል በሴት ነገር የተነሳ በእጁ ነፍስ ያጠፋል በብርቱ እልከኛ ነው አዛኝም ነው የኋላ ኋላ ወደ አባቱ እርስት ይመለሳል ጥቁር ነገር ሁሉ ክፍሉ ነው በሽምግልና ዘመኑ መጠጥ ያበዛ እንደሆነ ዓይኑ ይጠፋል ጤናው ይሰናከላል የራሱ ጠጉር ሽልት ነው በቀኝ እጁ ምልክት አለበት ሀብታም ነው መኳንንት ይወዱታል። ሳይደኸይና ሳይበለፅግ በልክ ሆኖ ደስታና ኃዘን እየተፈራረቀበት ይኖራል ጸሎቱ ግን ሥሙርና የተወደደ አስብ ያለው ነው። ስደት ያገኘዋል እድሉ ነውና በሰው ሀገር ይከብራል በመመላለስ ሀብት ያገኛል የመልእክት ጉዳይ ይከናወንለታል ባህሪው እጅግ ንፁህና የዋህ ነው ገንዘብ ይወዳል ንፉግ ግን አይደለም መቆጠብን ያውቃል አለማዊነትን ይወዳል እስከ ሽምግልና ዘመኑ ድረስ ዘማዊነት አያጣውም እጅግ ቅንዝረኛ ነው መፅሀፍት ለመፃፍ ቅኔ ለማስተካከል ስጦታ አለው የተማረ እንደሆነ ማንበብና መተርጎም ፅህፈትም ክፍሉ ነው እሳት ይለክፈዋል ውሀ ሙላትና መብረቅ ያስፈራዋል። ዓይኑ እንደ መነጽር ነው ልቡ ብሩህ የክርስቲያን ወዳጅ የአረመኔ ጠላት ነው ቂጥኝ ንዳድ ውጋትና ኩፍኝ ያስፈራዋል ሌሊት በዝናብ ወደ ደጅ አይውጣ በ22 አመቱ ይታመማል በ50 አመቱ ሞት ያስፈራዋል። የመጀመሪያ ሚስቱ ትፈታዋለች ከብዘ ጭቅጭቅ በኃላ በደህና ይኖራሉ ቤተ ሰዎቹና ጎረቤቶቹ ይመቀኙታል እግር ብረት ያስፈራዋል ፀሃይ ሳትወጣ መጓዝ አይመቸውም ዘፈንና ዜማ ይወዳል ቁም ነገራም ነው ሐሰት አይወድም ቀይ ሴት ዘመዱ በጉሽ ጠላ ወይም በስንዴ እንጀራ በዘመነ ማቴዎስ በግንቦት ወር መድሀኒት ታደርግበታለች። በጀርባውና በጭኑ ምልክት አለበት አንድ ጊዜ እግሩን ብርቱ ቁስል ያመዋል። መጋኛ ቀኝ እግሩን ጉልበቱን ወገቡን ያመዋል ሆዱን ይነፋዋል የዛር ውላጅ ያስፈራዋል የሰው ዓይን ይወጋዋል የሚመለከቱት ዛሮች ብር አለንጋ ሰይፍ ጨንገር ዕንቁላል ናቸው።ዋስ አጋች የሚባል ዛርም ገና ሲወለድ በደም ላይ ጀምሮ ቁራኛ ሆኖ ይጠባበቀዋል ጠቃርም ይወጋዋል ሁለመናውን ይልሰዋል። በጥቁር ፍየል ብራና መርበብተ ሰለሞንንና መስጥመ አጋንንትን መፍትሔ ስራይንም እፅፎ ይያዝ ዳለቻ ወይም ጥቁር የጥቁር ገብስማ ዶሮ ወይም ነጭ ዶሮ ጭዳ ብሎ ይረድ። ምን ግዜም ሲያመው ለህመሙ የሚበጀው ቡይት ወፍ አሳ ሰሊጥ አፍርንጅ በጥቁር ላም ወተት እያማገ ይብላ።የበቀለ ቀንድ የቁልቋል ሥር የዘምባባ ሥር አንድ ላይ ደቁሶ በመሐል ራሱ ይቀባ የቡያ የርግብ ስጋ የሪያ ስጋ የአውራሪስ ቀንድ አንድ ላይ አድርጎ ይታጠን። ኤፍራን ቀለም ነጭ እጣን አበሱዳ በጠጅ አንፍሮ ይጠጣ። ከከዋክብት ግጥሙ ሐመል ሚዛን ሸርጣን ናቸው ፀሩ ቀውስ ገውዝ አሰድ ነው ማእከላዩ ደለዊ ሠውር አቅራብ ናቸው። ዘመነ ማርቆስ ያስፈራዋል ከወሮችም የካቲትና መጋቢት ግንቦት አይሆነውም ኅዳርና ታህሳስ ግጥሙ ነው ሮብና አርብ ቀን አይሆነውም ሰኞና ቅዳሜ ግጥሙ ነው። በዘመነ ማርቆስ በግንቦት 13 እሑድ ቀን ይሞታል ቢፀልይ ቢያዝን ቢያሳዝን እስከ 90 አመቱ ይቆያል።\n\n\tጀዲ መሬት ኮከብ ያላት ሴት የሆነች እንደሆነ :- በጥርስዋ ላይ ምልክት አለባት ሃብታም ናት ጥሪትና ራት አላት ልጆች ትወልዳልች አንድ ልጅ ይሞትባታል ደግነትና ቸርነት አላት የዋህነት አለባት ሰውነቷን ችላ ትለዋለች ሰውን አማኝ ናት ግን ወዳጆችዋ ይከዷታል ንፉግ ናት የኃላ ኋላ ትቸገራለች አረመኔ ባዳ ያገባታል። በወሊድ ደም ያስፈራታል የደም አብነት ትያዝ በጥቁር ፍየል ብራና አስማተ ሰለሞንን ከእሪያ ስጋ ጋር አፅፋ ትያዝ በ30ና በ50 አመቷ ሞት ያስፈራታልና ትጠንቀቅ። የሚመለከቷት ዛሮች ቁርጠትና ሚሚት ናቸው በአንገቷ ኮልባና መዳብ ቀለበት ብታስር ይሻላታል ቡሀ በግ ጭዳ ብላ አሳርዳ በደሙና በፈርሱ ትታጠብ።',
        'ደለዊ-ነፋስ/Aquarius': '\tይህ ኮከብ በጥር 12 ቀን ከደቡብ ይወጣል በበሬ ይመሰላል ደለዊ ማለት ሁሉን አደላዳይ ወይም ኃይለኛ ማለት ነው በጎሽ በአንበሳም ይመሰላል። ይህ ኮከብ ያለው ሰው ብርቱ ሃይለኛ ጠብ ወዳጅ ትምክህተኛ ነው ያሰበውን ካላደረገ አይመለስም ትጉ ሠራተኛ ፍጥረት ነው ለኑሮው በፊቱ ላብ ይታገላል ሥራም ይወዳል ብርቱ ደም ካፍንጫው ይነስረዋል ሣቅ ያበዛል አንጉቱን አቀርቅሮ ይሄዳል በገንዘቡ የተነሳ ይቆጣል የፊቱ አወራረድና የግንባሩ አኮመታተር በሬ ይመስላል ደም ግባታምና ተወዳጅ ግርማ ያለው መልክ አለው እርሻ ክፍሉ ነው ንብና በግ ይረባለታል ነጭ ነገር ይሆነዋል ጨዋታ አዋቂ ነው መለማመጥን አይወድም እንጂ መኳንንት ያፈቅሩታል ጌታ ይሆናል ገንዘብ ለልጁ አይተርፍም እንቅፋታም ነው በ15 በ30 እና በ40 አመቱ ይጠንቀቅ የልብ ሕመምና ሳል ያስፈራዋል ቀይ አረመኔ በግራ እጇ ምልክት ያለባት ሴት ቢያገባ ይወልዳል ትሆነዋለች የአባቱን እርስት ይወርሳል ብዙ ልጆች ይወልዳል ዘማዊነት አለው እስከ ዘመዶቹ ማውሰብ ይደርሳል። መልከ ቅን ተወዳጅ ነው ዘመኑን ሁሉ በሰላምና በደስታ  ይኖራል በሴት ፍቅር የተነሳ ከትልቅ አምባጓሮ ይደርሳል ሁልጊዜ መጠንቀቅ የሚገባው ከደም ነስር እና ከውጋት ሕመም ነው ደለዊ ነፋስ የመሬት ሰራተኛ ብቻ አይደለም የጥብቅነትና የንግድም ስራ እድሉ ነው ነገር ግን በሰው ዘንድ ስሙ በክፉ ይነሳል። ፍርድና ምርመራም ያውቃል ንግግሩና አንደበቱ ተወዳጅ ነው መተቸትና ማስረዳት መተርጎምም ያውቃል ጠባዩ ብርቱ ነው ሀሰትም ቢሆን በተናገረው ይፀናል ጥልቅና ሩቅ የሆነ ሚስጥር ያውቃል እግዚአብሔርን ይፈራል የጉራና የመግደርደር ባህሪ አለው ወረተኛ ነው ገንዘብ ያባክናል፣ ያገኛል ያጣል ሃብታም ነው ብዙ መከራ አያገኘውም ከመከራና ከፈተና ለመውጣት ብልህነት ተሰጥቶታል ወዳጅና ጠላት ባዕድና ዘመድ አይለይም ቂም የለውም እንደ እርግብ የዋህ ነው አይሆንለትም እንጂ ንፁህና ጌጠኛ ልብስ ይወዳል እድፋም ልብስ አይሆነውም የባዕድ ሀገር እድሉ ነው ባለ ፀጋ ይሆናል በተወለደበት ሀገር ግን ጠላት ይበዛበታል ሰጥቶ አይመሰገንም ለአጭር ጊዜ በድህነት ላይ ይወድቃል ተበድሮም ቢሆን ሰውን መምሰል ይወዳል የሰው ምክር አይሰማም በአደጋና በጭንቅ ጊዜ ይሸበራል አይችልም ይጃጃል ወላዋይ ነው ሳያስበው በአጋጣሚ ብዙ ገንዘብ ያገኛል በሀሰት ይምላል ነገር ይጠብቃል እኔ ያልሁት ይሁን ይላል ሰውን ይንቃል ያቃልላል በምሥራቅ አገር ክፍል አለው የኮሶ ምች ያስፈራዋል። በዘመነ ማርቆስ በጥቅምት ወር ያመዋል መድሃኒቱ ቀይ ወይም ነጭ ዳለቻ በግ ገብስማ ዶሮ ይረድ እውነተኛ ነው ዋስ መሆን አያምርበትም በትንሽ ነገር ንጉስ የሆነ ያህል ይደሰታል ደለዊ ከዘመዱ ጋር አይኖርም እርሱም ዘመዱን አይዉድም መቃብሩንና ሬሳውን እንኳን ሊያይ አይፈቅድም የሚመለከተው ዛር ብር አለንጋ ነው የእግሩን ጫማ ጫንቃውንና ጉልበቱን ያመዋል ከደጁ ሥራይ ይጣልበታል አስቀድሞ ለዚህ የሚሻለው የቀይ ከላድማ ፍየል ቀይና ገብስማ ዶሮ ይረድ ቀይ ወይም ነጭ የአዳል በግ አርዶ መረቁን ይጠጣው በብራናውም ትምህርተ ኅቡአትንና ስመ አምላክን ኤኮስንና አካስን አፅፎ ይያዝ ዓሣና ሰሊጥ ወገርትና ምስርች ጠምበለልም ሥራቸውን ስናፍጭም ቅጠሉንና ፍሬውን እነዚህን ሁሉ አንድላይ አሰርቶ መረቃቸውን ይጠጣ። ሆዱን ያመዋል በማርቆስና በሉቃስ ዘመን በጥቅምት ወር አርብ ቀን ያስፈራዋል ተፃራሪዎቹና ለሞት የሚያደርሱት ዛሮች ሰይፈ ጨንገር ወሰን ገፊ ጠቋር ዲራ ጉቶች ናቸው መድሃኒቱ ከላይ የተፃፈው ነው ።ፀር ኮከቦቹ ሸርጣን ሰንቡላ ጀዲ ናቸው ክፍሎቹ አሰድ አቅራብ ሰውር ናቸው ማእከላዩ ሁት ገውዝና ቀውስ ናቸው። ከዘመነ ሉቃስ ከወር የካቲትና ጥቅምት አይሆነውም መልካም ቀኖቹ ሰኞና ሐሙስ ክፉ ቀኖቹም ሮብና ዓርብ ናቸው። የዕድሜው ልክ 85 አመት ነው ቢያዝን ቢፀልይ ቢያሳዝን 95 ይሞላዋል በዘመነ ሉቃስ ነሀሴ አስራ ሶስት ቀን የደብረ ታቦር ዕለት ይሞታል።\n\n\tደለዊ ነፋስ ኮከብ ያላት ሴት የሆነች እንደሆነ :- እግርዋ ቀጭን መልከ ደማም ትሆናለች ቁም ነገረኛ ወላድ ሀብታም ባለብዙ ፍሬ ትሆናለች የሰው ፍቅር አላት ነገር ግን ትንሽ ቀን ትቀነዝራለች በወሊድ ጊዜ ደም ያስፈራታል እጣንና ከርቤ ትታጠን እጇ ለመስጠት ቸርና ለጋስ ናት የተናገረችውና የአሰበችው ፈቃድዋ ካልሆነ በጀ አትልም ደግ ምክርና የነገር አመላለስ ታውቃለች በነጭ የአዳል በግ ብራና ትምህርት ኅቡአትንና ኤኮሳትን አፅፋ ትያዝ ደጋግ ልጆች ትወልዳለች የቤት አያያዝ ታውቅበታለች ቁጠባና ብልህነት ዕድልዋ ነው። ዕድሜዋ ከ55 እና ከ80 አያልፍም።',
        'ሑት-ውሀ/Pisces': '\tይህ ኮከብ ከ12 ከዋክብት ጋር በየካቲት 12 ቀን በምሥራቅ በኩል የሚወጣ ነው። ምሳሌው ከይሲ ነው በዓሣና በአንበሳም ይመሰላል ሑት ነገረ ኮትኩት ይባላል። ይህ ኮከብ ያለው ሰው ነገሩ ሁሉ ጠንካራና ጥብቅ ነው ቁጡና ደፋር ነው በተቆጣ ጊዜ ልሳኑ ይታሰራል ሰጭና ለጋስ ነው ለድሀ ይራራል ጾመኛና ፀሎተኛ እግዚአብሔርን ፈሪ ቤተክርስቲያን አዘውታሪ ይሆናል። ከእናቱ ማህፀን የተመረጠ አስተዋይና ብልህ ነው ተንኮለኛና ቀናተኛ መሠሪና ምቀኛ ነው ይህን ሁሉ ግን በሽንገላ ተግባሩ ሰውሮት ይኖራል ትሁትና ሰው አክባሪ መስሎ ይታያል አቅም ሲያንሰው እንደ እባብ ብልህ ነው ሲመቸው ግን የዋህነት አይሆንለትም ጨቅጫቃ ነው ነገር በቶሎ አይቆርጥም ከልክ ያለፈ ዘማዊ ነው አይታወቅበትም እንጅ እስከ ዘመዱ እንኳ ያወስባል መላ አዋቂ ከአቅሙ በላይ ኩሩ ነው እንኳን ሰውን እንስሳና አውሬም ቢሆን ለማታለልና ለማዳ ለማድረግ ዕድለኛ ነው። አገረ ገዥ ይሆናል ስርአት ያውቃል እግሩ ጠማማ ምህረት የሌለው ተበቃይና ጨካኝ ነው በሽምግልና ወደ ፈጣሪው ይመለሳል በገዳምና በምንኩስና ቢኖር ክፍሉ ነው ኃጢያቱ ይሰረይለታል። ነቢያትና ሐዋርያት ባረፉበት ቀን ያርፋል ገንዘብ ቢኖረውና ባይኖረውም ሁሉም አንድ ነው ልጆች ይወልዳል ንግድና መልእክት ይስማማዋል ተስቦና ተቅማጥ ያስፈራዋል በቤቱ አይሞትም ድንገተኛ ነው። ነገሩ ሁሉ ጥብቅና እሙን ነው ገንዘብ ያበደረው ሰው ተመልሶ ጠላት ይሆነዋል ሲሔድ ፈጣን ነው የሚሮጥ ይመስላል እንግዳ ማስተናገድ ይወዳል ማናቸውም ምስጢር አይሠወርበትም ጨዋታና ቀልድ ያውቃል ይወዳል ከ50 አመቱ በኋላ ገንዘቡ ያልቅበታል ቅንዝረኛና ዘማዊ ነው በትምህርት እጅግ አይሰለጥንም ዓዋቂና አስተዋይ ነው ተኝቶ ሀሳብ ያበዛል ብዙ ጊዜ ገንዘቡ ይሰረቅበታል ወይም ይወረሳል ማታ ተጣልቶ ማለዳ ይታረቃል ጠባዩን ማንም አያውቀውም ተለዋዋጭና ስውር ነው። በልግስናው ዝናው የታወቀ ነው እርሻና ንግድ ይሆንለታል አህያና ንብ ይረባለታል ዳተኛና ሰው ተጫኝ ፣ አያሳዝንና አያስደስት ነው ዘመዱና ጎረቤቱ ይጠላዋል ቢያበላና ቢያጠጣ አይመሰገንም ዘመዱን ይንቃል ያልታሰበ ጸጋ ያገኛል ጊዜ ካነሳው ጋር ይፋቀራል ያውም ለጥቅሙ ሲል ነው ከሁሉ ሰው ጋር ፈገግተኛ ነው ውስጣዊ ባህሪውን አይገልፅም እስከ ባህር ቢነግድ ክፍሉ ነው መጠጥ ይወዳል ጥቁር ከብት እድሉ ነው በሚስቱ ምክንያት ነገር ያገኘዋል በልጅነቱ ገንዘብ ያገኛል በመካከል ያጣል እንጀራው በሽበት ነው። በእጁ በእግሩ በወገቡ ምልክት አለበት ሆዱን ይነፋዋል ብረት ያቆስለዋል ከንዳድና አውሬ ከማደን ይጠንቀቅ በሁሉም ነገር ረዳቱ ፈጣሪው ብቻ ነው እንጂ ሰው ሁሉ ጥፋቱን ይጠብቃል የሴት ሥራይ ያስፈራዋል የጥቁር ገበሎ ስጋ አንድ በቀል ፍየለ ፈጅ እዩባን የምድር እምቧይ በአንድላይ አድርጎ በጥቁር ፍየል ብራና አስማተ ሰለሞንና ባርቶስን አፅፎ ይያዝ ዓርብ ሮብ እሑድ ክፍሉ አይደለም እንቅፋት ያገኘዋል መድሃኒአለምን ያክብር ደረቅ ተሟጋች በእልኩ ዘላቂ ነው በደጋ ሀገር ይቀመጥ። በተወለደ በሰላሳ አመቱ ሁለመናውን ብርቱ ቁስል ያስፈራዋል ወጣሌ የሚባል የደጋ ዛር በመንፈቀ ሌሊት ወደ ደጅ ሲወጣ ተጠናውቶ ይይዘዋል ብራቅ ወንዝ አድርቅ መዓት ወረድ ኩርንችት የሚባሉ ዛሮች ይይዙታል ሌሊት በህልሙ በድቀተ ሥጋ እየመጡ ያስደነግጡታል ዋስ አጋችና አጋም ጣስ ዕንቁላልና ማኅደር ይጫወቱበታል ከውሀ ጥም የተነሳ ብርቱ ሕመም ያገኘዋል ራሱን ወገቡን አይኑን ይነድለዋል ዘመዶቹ መድሃኒት ያደርጉበታል በሆዱ እንደ ሥራይ ይሰራበታል እያስጮኸና እያፏሸከ ያመዋል። ለዚህ በሽታ መድሀኒቱ ዝንጅብልና ኮረሪማ ሰሊጥና ቁንዶ በርበሬ እሩህና ከናንህ በእሞሌ ጨው አጣፍጦ ወንጌለ ማርቆስና ኪዳን ደግሞ በዓሣ መረቅና በቀይ ጤፍ እንጀራ ፈትፍቶ ሰባት ቀን ይብላ በሐምሌ ወር መንገድ አይሂድ አይሆንለትም ። እኩይ ወሩ ጥቅምት ግንቦት ነሐሴ ሠናይ ወሩ መስከረምና ታህሳስ ነው ከኮከብ ፀሩ አሰድ ሚዛን ደለዊ ነው ክፍሉ ገውዝ ሰንቡላ ቀውስ ነው በተወለደ በ88 አመቱ በዘመነ ዮሐንስ በሐምሌ ወይም በመጋቢት ዓርብ ቀን ይሞታል። \n\n\tሑት ውሀ ኮከብ ያላት ሴት የሆነች እንደሆነ :- መልከ ቀና የማታሳልፍ ቀናተኛ ናት ባሏንም ታስቀናዋለች ከወዳጁ ጋር ታጣላዋለች ዘማዊ ናት ወሲብ አትጠግብም ነገር አታቋርጥም ደፋር ምላሰኛ ናት መጠጥ ትወዳለች ስካር ይቃወማታል ችኮ፣ሸውሻዋ ናት ነገር ታማታለች ንፍገት አለባት ባልትና አታጣም እጀ ሰብእ ያስፈራታል ልጅ ይሞትባታል የመርገም ደምዋ ይፈታባታል የጋላ ዛር ያድርባታል ወደርሱ ያስመልካታል ወጣሌ የሚባል ዛር በወቅት ጊዜ ይመታታል እግሯን ይቆረጥማታል አቅዳፌርና ኤኮስን በዳለቻ በግ ብራና አፅፋ ትያዝ።'}
    return  kokeb_name_discription_pair
def wealth_pair():
    wealth_luck_pair = {
     '1':'ባለ ጸጋ ይሆናል፡፡',
     '2':'መጀመሪያ አጥቶ በኋላ ያገኛል፡፡',
     '3':'እስከ እለተ ሞቱ ደሃ ሆኖ ይኖራል፡፡',
     '4':'ባለ ጸጋ እጅግ ሃብታም ነው፡፡እጁ አይፈታም ለሰው በጣም ንፉግ ነው፡፡',
     '0':'ባለ ጸጋ እጅግ ሃብታም ነው፡፡እጁ አይፈታም ለሰው በጣም ንፉግ ነው፡፡',
     }
    return wealth_luck_pair
def behavior_pair():
    behavior_def_pair = {
        '1':'ግስላ ነው፤አየነ ፈሪ ንፉግ ካልነኩት አይነካ ሰው አይወድ ነው፤',
        '2':'ውሻ ነው፤ የማይከብር የማይሾም ወራዳ ሃብቱ ትንሽ የማይቀመጥ ዘዋሪ ነው፤',
        '3':'ድመት ነው፤ ሁሉ ሰው የሚወደው የሚሄድበት የማይታወቅ ሴሰኛና ቅንዝረኛ ተለማማጭ ሁሉን መስሎ አዳሪ ከዳተኛና ዋሾ ተታላይ ከተመቸው ቀሪ ነው፡፡ብቸኝነትን ይወዳል አሳዛኝ መሳይ ነው፡፡',
        '4':'ተኩላ ነው፤ ለማኝ ያየውን ሁሉ ከጃይ ዘዋሪ ከተመቸው ሁሉ ሂያጅ መብልና መጠጥ ወዳጅ ከአንድ ቦታ የማይቀመጥ ኮብላይና መለኛ ነው፡፡',
        '5':'ጅብ ነው፤ ጉልበታም ልበ ፈሪ ከተነሳ የማይወድቅ ከተሾመ የማይሻር ጠላቱን አሸናፊ መቸም መብልና መጠጥ የማያጣ ጉረኛ ነው፡፡',
        '6':'ነብር ነው፤ አይነ ደፋር ደረቅ ኩራተኛ እቡይ ጠላቱን ሁሉ አሸናፊ ሆዱ የሚባባ ከተነሳ የማይወድቅ ከተሾመ የማይሻር ንጹህና ጸሎተኛ ነው፡፡',
        '7':'አንበሳ ነው፤ ክፉ አመጸኛ እቡይ ኩራተኛ ከወደቀበት የማይነሳ ሰው ናቂ ሃብቱን በገዛ እጁ አሳጣሪ ነው፡፡',
        '8':'ዝሆን ነው፤ ሞኝ መሳይ ዝግተኛ ያለብርቱ ነገር የማይወድቅ ሃይለኛ ቂም ያዢ ወዳጁንና ጠላቱን የማይለይ ከያዘ የማይለቅ ከተሾመ የማይሻር እድሉ ሁልጊዜ ዘመቻ ነው፡፡', 
        '9':'ድብ ነው፤ ይሉኝታ የሌለው ዘማዊ ቅንዝረኛና ዋሾ የነገር መልስ አዋቂ አሉተኛ ሲናገር እውነት አስመስሎ ሁሉን የሚያሸነፍ ነው፡፡' ,
        '0':'ድብ ነው፤ ይሉኝታ የሌለው ዘማዊ ቅንዝረኛና ዋሾ የነገር መልስ አዋቂ አሉተኛ ሲናገር እውነት አስመስሎ ሁሉን የሚያሸነፍ ነው፡፡'
    }
    return behavior_def_pair
def place_luck_pair():
    place_luck_def_pair = {
        '1':'ሃብታም መሬት ነው፤ ተቀመጥ፡፡',
        '2':'እድሜህ ያጥርብሃል፡፡',
        '3':'ለአንተ ክፉ ነው፤ ጋኔን ይጻረርሃል፡፡',
        '4':'ሃብትህ ብዙ ይሆናል፤ ሲሳይም ታገኝበታለህ፡፡',
        '5':'ፊት አግኝተህ ኋላ ድሃ ትሆናለህ፡፡',
        '6':'ደዌና ምቀኛ ይበዛብሃል፡፡',
        '7':'በጣም መልካም ነው፤ ሃብትና ሹመት ከጤና ጋር ታገኝበታለህ ተቀመጥ፡፡',
        '0':'በጣም መልካም ነው፤ ሃብትና ሹመት ከጤና ጋር ታገኝበታለህ ተቀመጥ፡፡',
    }
    return place_luck_def_pair
def marriage_luck_pair():
    marriage_luck_def_pair = {
        '1':'ሴቲቱ በረከት አላት፡፡',
        '2':'ወንዱ በረከት አለው፡፡',
        '3':'ሁለቱም በረከት የላቸውም፡፡',
        '4':'ጥቂት በረከት አላቸው፡፡',
        '0':'ጥቂት በረከት አላቸው፡፡',
    }
    return marriage_luck_def_pair
def pregnancy_prophecy():
    pregancy_pair = {
    '1':'ወንድ ትወልዳለች',
    '2':'ያስወርዳታል' ,
    '3':'ሴት ትወልዳለች' ,
    '4':'ሴት ትወልዳለች' ,
    '5':'ወንድ ትወልዳለች',
    '6':'ሴት ትወልዳለች',
    '7':'ወንድ ትወልዳለች',
    '8':'ዘር የለም(አትወልድም)',
    '0':'ዘር የለም(አትወልድም)',
    }
    return pregancy_pair
def love_prophecy():
    love_prophecy_pair = {
    '1':'መልካም ፍቅር ነው',
    '2':'ወላዋይ (መስመር ያልያዘ) ፍቅር ነው',
    '3':'ክፉ ፍቅር ነው',
    '4':'መልካም ፍቅር ነው',
    '5':'መልካም ፍቅር ነው',
    '6':'ወላዋይ (መስመር ያልያዘ) ፍቅር ነው',
    '7':'እጅግ መልካም ፍቅር ነው',
    '8':'ወላዋይ (መስመር ያልያዘ) ፍቅር ነው',
    '0':'ወላዋይ (መስመር ያልያዘ) ፍቅር ነው',
    }
    return love_prophecy_pair
def born_prophecy():
    born_pair = {
    '1':'ዓይነ ጨምጫማ ይወለዳል',
    '2':'ቀይ ሴት ትወለዳለች',
    '3':'ጥቁር ሴት ትወለዳለች',
    '4':'ቀይ ሴት ትወለዳለች',
    '5':'እግረ ቀጭን ወንድ ይወለዳል',
    '6':'የቀይ ዳማ ወንድ ይወለዳል',
    '7':'ጥቁር ወንድ ይወለዳል',
    '8':'ራስ ሸላታ ይወለዳል',
    '0':'ራስ ሸላታ ይወለዳል',
    }
    return born_pair
def life_luck_prophecy():
    life_luck_pair = {
    '1':'በሹመት ትኖራለህ',
    '2':'በንግድ ትኖራለህ',
    '3':'በዙረት ትኖራለህ',
    '4':'በእጅ ስራ ትኖራለህ',
    '5':'በወታደርነት ትኖራለህ',
    '6':'በብክንክን ትኖራለህ',
    '7':'በቤተ መንግስት ትኖራለህ',
    '8':'በዙረትና ልፋት ትኖራለህ',
    '9':'በንግድና እርሻ ትኖራለህ',
    '0':'በንግድና እርሻ ትኖራለህ',
    }
    return life_luck_pair
def servant_behavior():
    servant_pair = {
    '1':'በስራው ያስደስትሀል',
    '2':'ተንኮለኛ ነው ያጠፋሀል',
    '3':'ክፉ ነው ይሰርቅሀል',
    '4':'አይጠቅምህም ያሳዝንሀል',
    '5':'በሽተኛ ይሆንብሀል',
    '0':'በሽተኛ ይሆንብሀል',
    }
    return servant_pair
def patient_prophecy():
    patient_pair = {
    '1':'ይሞታል',
    '2':'በህመም ይኖራል',
    '3':'ደህና ይሆናል',
    '4':'ይሞታል',
    '5':'አካሉ ይጎድላል',
    '6':'ብዙ ጊዜ ታሞ ይድናል',
    '7':'በቶሎ ይፈወሳል',
    '0':'በቶሎ ይፈወሳል',
    }
    return patient_pair
def marriage_time():
    marriage_pair = {
    '1':'በወንድ ይበኩራሉ ብዙ ዘመን ይኖራሉ ይፋቀራሉ አይፋቱም ባልየው በሞት ይቀድማል',
    '2':'በሴት ይበኩራሉ ብዙ ልጆች ይወልዳሉ ሚስትየዋ በሞት ትቀድማለች',
    '3':'ይፋታሉ ይታረቃሉ በመካከለኛው ጊዜ አብረው ይኖራሉ ሀብት ያገኛሉ ሚስትየው በሞት ትቀድማለች',
    '4':'በሴት ይበኩራሉ ብዙ ይወልዳሉ በሰላም ይኖራሉ ሚስትየው በሞት ትቀድማለች',
    '5':'በወንድ ይበኩራሉ ትልቅ ሀብት ያገኛሉ ይፋታሉ ይታረቃሉ በጭቅጭቅ አብረው ይኖራሉ ባልየው በሞት ይቀድማል',
    '6':'በሴት ይበኩራሉ ብዙ ሴቶች ይወልዳሉ ሀብትን አያገኙም በሰላም ይኖራሉ ሴትየዋ በሞት ትቀድማለች',
    '7':'በወንድ ይበኩራሉ ትልቅ ሀብትና ጤና ያገኛሉ አይጣሉም ይፋቀራሉ በሰላምና በደስታ ይኖራሉ ባልየው በሞት ይቀድማል',
    '8':'እርስ በእርሳቸው አይተማመኑም ይጠራጠራሉ ብዙ ሴቶች ይወልዳሉ በመጨረሻም ይፋታሉ ሚስትየው በሞት ትቀድማለች',
    '0':'እርስ በእርሳቸው አይተማመኑም ይጠራጠራሉ ብዙ ሴቶች ይወልዳሉ በመጨረሻም ይፋታሉ ሚስትየው በሞት ትቀድማለች',
    }
    return marriage_pair
def enemy_behavior():
    enemy_pair = {
    '1':'ቀበሮ ነው አዳኝ ከአደጋ የሚያመልጥ ሀብታም ነው',
    '2':'ጥንቸል ነው መሸሽ የሚያበዛ ፈሪ ነው',
    '3':'ውሻ ነው ለማኝ አሳዛኝ ተመጽዋች ወራዳ ነው',
    '4':'ተኩላ ነው ደፋርና አዳኝ ሃይለኛና ሃብታም ተንኮለኛና መለኛ ለጠላቱ የማይጠመድ እድለኛ ነው',
    '5':'ጅብ ነው ልበ ፈሪ ጉልበታምና ሲሳይ ያለው ድምፀ ጀግና ነው',
    '6':'ነብር ነው የእግዚአብሔር ወዳጅ ንፁህ ፀሎተኛ ፍርድ አዋቂ ሀብታም ጦም የማያድር ንፉግና ጠርጣሪ ተለማመጡኝ ባይ እልከኛ ነው',
    '7':'አንበሳ ነው ሃይለኛና አዳኝ ኩሩ አስደንጋጭና አስፈሪ ፎካሪ ሀብታምና ሲሳያም እድለኛ ነው',
    '8':'ዝሆን ነው ዝምተኛ መሳይ ቂመኛ ሰውነቱ ግዙፍ እድሜው ብዙ ሀብታም ቸርና ከሰው አዳሪ ካልነኩት አይነካ ነው',
    '9':'ድብ ነው አዘንጊ ልበ ቢስ ሁሉን ናቂ ቅንዝረኛና ዝምተኛ ሀብታምና ለጋስ ነው',
    '0':'ድብ ነው አዘንጊ ልበ ቢስ ሁሉን ናቂ ቅንዝረኛና ዝምተኛ ሀብታምና ለጋስ ነው',
    }
    return enemy_pair
def legal_case_prophecy():
    legal_pair = {
    '1':'በፍጥነት ትረታዋለህ',
    '2':'ወላዋይ ቀጠሮ ነው በቶሎ አይፈፀምም',
    '3':'ወላዋይ ቀጠሮ ነው በቶሎ አይፈፀምም',
    '4':'በአንተ ላይ ይፈረድብሀል',
    '5':'ትታረቃላችሁ',
    '0':'ትታረቃላችሁ',
    }
    return legal_pair

def military_prophecy():
    military_pair = {
    '1':'ትያዛለህ ትማረካለህ ትፋጃለህ ትዘረፋለህ ትደሰታለህ ትመሰገናለህ ትሾማለህ ትሸለማለህ::',
    '2':'ሠራዊት ያልቅብሀል በረሃብና ውሀ ጥም ትቸገራለህ ትከበባለህ ይጨንቅሃል ነገር ግን አንተ አትያዝም ታመልጣለህ::',
    '3':'ወጥተህ ዘምተህ ተዋግተህ ድል አድርገህ ጠላትህን አስገብረህ አስረህ ማርከህ በአሸናፊነትና ግርማ ታጅበህ ትመለሳለህ::',
    '4':'ጠላትህ ያይልብሀል ትሸሻለህ አገር ታስደመስሳለህ ሕይወትህንም ያስፈራሀል::',
    '0':'ጠላትህ ያይልብሀል ትሸሻለህ አገር ታስደመስሳለህ ሕይወትህንም ያስፈራሀል::'
    }
    return military_pair
