from django.shortcuts import render # type:ignore

# Create your views here.
def about_us(request):
   
    qa_pair = [
    ('በስም ከታወቀና በተወለድንበት ወር ከታወቀ ኮከብ ትክክለኛው የቱ ነው?','የእርስዎን ባህሪ በትክክል የሚገልጸው በእርስዎና በእናትዎ መጠሪያ ስም የተሰላው ኮከብ ነው፡፡'),
               ('ስሙን ያስቀየረ ሰው በየትኛው ስሙ ነው ኮከቡን ማወቅ የሚችለው?','አንድ ሰው ስሙን ካስቀየረ መጠቀም ያለበት የመጀመሪያውን ስም ነው፡፡'),
               ('የፊደል መቀያየር የኮከብ ለውጥ ያመጣል?','አዎ፤ በስምዎ ውስጥ ሁለት አይነት ዋጋ ያላቸው ፊደሎች ቢኖሩና የተሳሳተ ፊደል ቢጠቀሙ ውጤቱም የተሳሳተ ይሆናል፤ ለምሳሌ አለሙና ዐለሙ የተለያየ ኮከብ ይሰጡናል፡፡'),
               ('ስሜን በአማረኛና በ እንግሊዘኛ ማስገባት እችላለሁ?','ለጊዜው ማስገባት የሚቻለው በአማርኛ ብቻ ሲሆን በትክክል እንግሊዘኛን ወደ አማርኛ የሚቀይር ፕሮግራም እየሰራን ስልሆነ ወደፊት በሁለቱም ማስገባት የሚቻል ይሆናል፡፡'),
               ('የኮከብ ጥናት ትክክለኛነት ተረጋግጧል?','የኮከብ ጥናት ትክክለኛነት በሳይንስ ያልተረጋገጠ ሲሆን በሃገራችን ግን ከጥንት ጀምሮ ለብዙ ጉዳዮች ጥቅም ላይ የዋለ ነው፡፡ በርካታ አማኞችም አሉት የዚህ ድህረ ገጽ ዋና አላማም ጥናቱን ማድረስ ብቻ ነው፡፡'),
    ]      

    return render(request, 'aboutus/aboutus.html',{'faqs':qa_pair})